released/RL78_F24_CAN/src/smc_gen/r_rscanfd_rl78/r_rscanfd_rl78.c
/**********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
 * other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO
 * THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2022 Renesas Electronics Corporation. All rights reserved.
 *********************************************************************************************************************/
/**********************************************************************************************************************
 * File Name    : r_rscanfd_rl78.c
 * Description  : This is source file for CAN driver code.
 *********************************************************************************************************************/
/**********************************************************************************************************************
 * History : DD.MM.YYYY Version  Description
 *         : 20.04.2022 1.00     Initial Release
 *********************************************************************************************************************/

/**********************************************************************************************************************
 Includes   <System Includes> , "Project Includes"
 *********************************************************************************************************************/
#include <stdint.h>
#include <stdbool.h>
#include "r_rscanfd_rl78_if.h"
#include "r_rscanfd_rl78_config.h"
#include "r_rscanfd_rl78_private.h"

/**********************************************************************************************************************
 Macro definitions
 *********************************************************************************************************************/
/* Ushort max */
#define CAN_USHORT_MAX                  (0xFFFFu)

/* Convert bytes to words */
#define CAN_BYTE_TO_WORD(x)             (((x) + 1u) / 2u)

/* Information label bit */
#define CAN_IFL_MSB                     (2u)
#define CAN_IFL_LSB                     (1u)

/* Word position of u_can_tx_head_t */
#define CAN_TX_HEAD_WORD_IDL            (0u)
#define CAN_TX_HEAD_WORD_IDH            (1u)
#define CAN_TX_HEAD_WORD_FDCTR          (2u)

/* Word position of u_can_rx_head_t */
#define CAN_RX_HEAD_WORD_IDL            (0u)
#define CAN_RX_HEAD_WORD_IDH            (1u)
#define CAN_RX_HEAD_WORD_FDCTR          (2u)

/* Data byte of classical frame */
#define CAN_CLASSICAL_MAX               (8u)

/* TXMB interrupt source */
#define CAN_SOURCE_TRM_TM0              (CAN_SOURCE_TRMC_TM0 | CAN_SOURCE_TRMA_TM0)
#define CAN_SOURCE_TRM_TM1              (CAN_SOURCE_TRMC_TM1 | CAN_SOURCE_TRMA_TM1)
#define CAN_SOURCE_TRM_TM2              (CAN_SOURCE_TRMC_TM2 | CAN_SOURCE_TRMA_TM2)
#define CAN_SOURCE_TRM_TM3              (CAN_SOURCE_TRMC_TM3 | CAN_SOURCE_TRMA_TM3)

/* Bit position of major version */
#define CAN_POS_MAJOR_VER               (8u)

/* Bit position of interrupt source argument */
#define CAN_POS_SOURCE_MLT_RF           (4u)
#define CAN_POS_SOURCE_TRMA             (4u)
#define CAN_POS_SOURCE_TRM_CF           (8u)

/**********************************************************************************************************************
 Merge Configuration
 *********************************************************************************************************************/
/* Nominal SJW */
#if (CAN_CFG_NSJW >= 0x40)
#define CAN_USER_NSJW6                  (1u)
#else
#define CAN_USER_NSJW6                  (0u)
#endif
#define CAN_USER_NSJW5_0                (CAN_CFG_NSJW & CAN_MASK_W6)

/* Tx Buffer Interrupt Enable */
#define CAN_U16_USER_TMIEC  \
    (CAN_U16_BIT3(CAN_CFG_TMIE3) | CAN_U16_BIT2(CAN_CFG_TMIE2) | \
    CAN_U16_BIT1(CAN_CFG_TMIE1)  | CAN_U16_BIT0(CAN_CFG_TMIE0))

/* Rx Buffer Interrupt Enable */
#if (CAN_CFG_RMIE_ALL == 0)
    #define CAN_U16_USER_RMIEC_VAL      (0u)
#elif (CAN_CFG_RMIE_ALL == 1)
    #define CAN_U16_USER_RMIEC_VAL      (0xFFFFu)
#else
    #define CAN_U16_USER_RMIEC_VAL      (CAN_CFG_RMIE_VALUE)
#endif
#define CAN_U16_USER_RMIEC_MASK         ((CAN_U32_ONE << CAN_CFG_NRXMB) - CAN_U32_ONE)

/* Global Error Interrupt Enable */
#define CAN_U08_USER_GCTRLH \
    (CAN_U16_BIT3(CAN_CFG_CMPOFIE) | CAN_U16_BIT2(CAN_CFG_THLEIE) | \
    CAN_U16_BIT1(CAN_CFG_MEIE)     | CAN_U16_BIT0(CAN_CFG_DEIE))

/* Channel Error Interrupt Enable (register value) */
#define CAN_U08_USER_C0CTRLH \
    (CAN_U16_BIT7(CAN_CFG_ALIE) | CAN_U16_BIT6(CAN_CFG_BLIE)  | \
    CAN_U16_BIT5(CAN_CFG_OLIE)  | CAN_U16_BIT4(CAN_CFG_BORIE) | \
    CAN_U16_BIT3(CAN_CFG_BOEIE) | CAN_U16_BIT2(CAN_CFG_EPIE)  | \
    CAN_U16_BIT1(CAN_CFG_EWIE)  | CAN_U16_BIT0(CAN_CFG_BEIE))

/* Channel Error Interrupt Enable (OR value) */
#define CAN_USER_ERFL_IE \
    (CAN_CFG_ALIE | CAN_CFG_BLIE | CAN_CFG_OLIE | CAN_CFG_BORIE | \
    CAN_CFG_BOEIE | CAN_CFG_EPIE | CAN_CFG_EWIE | CAN_CFG_BEIE)

