released/RL78_F24_CAN/src/smc_gen/r_rscanfd_rl78/r_rscanfd_rl78.c
/* TDC Violation Interrupt Enable */
#if (CAN_CFG_TDCVFIE != 0)
    #define CAN_U08_USER_IE_C0FDSTSLH   (CAN_U08_C0FDSTSLH_TDCVF_ON)
#else
    #define CAN_U08_USER_IE_C0FDSTSLH   (0u)
#endif

/* Settings of CAN Global Receive FIFO Interrupt */
#if (CAN_CFG_INTRCANGRFR_USE != 0)
    #define CAN_U16_USER_IE_RFISTS      (CAN_U16_BIT1(CAN_CFG_RF1_RFIE) | CAN_U16_BIT0(CAN_CFG_RF0_RFIE))
#endif

/* Settings of CAN Global Receive FIFO Interrupt */
#if (CAN_CFG_INTRCANGRVC_USE != 0)
    #define CAN_U16_USER_IE_RMND        (CAN_U16_USER_RMIEC_VAL & CAN_U16_USER_RMIEC_MASK)
#endif

/* Settings of CAN Global Error */
#if (CAN_CFG_INTRCANGERR_USE != 0)
    #define CAN_U16_USER_IE_GERFLL      (CAN_U08_USER_GCTRLH)

    #define CAN_U16_USER_IE_FMSTS       (0x0103u)
#endif

/* Settings of CAN0 Channel Transmit */
#if (CAN_CFG_INTRCAN0TRM_USE != 0)
    #if (CAN_CFG_THLIE != 0)
    #define CAN_U16_USER_THIF           (CAN_U16_BIT4_ON)
    #else
    #define CAN_U16_USER_THIF           (0u)
    #endif

    #if (CAN_CFG_CFTXIE != 0)
    #define CAN_U16_USER_CFTIF          (CAN_U16_BIT3_ON)
    #else
    #define CAN_U16_USER_CFTIF          (0u)
    #endif

    #if (CAN_CFG_TAIE != 0)
    #define CAN_U16_USER_TAIF           (CAN_U16_BIT1_ON)
    #else
    #define CAN_U16_USER_TAIF           (0u)
    #endif

    #if ((CAN_CFG_TMIE3 | CAN_CFG_TMIE2 | CAN_CFG_TMIE1 | CAN_CFG_TMIE0) != 0)
    #define CAN_U16_USER_TSIF           (CAN_U16_BIT0_ON)
    #else
    #define CAN_U16_USER_TSIF           (0u)
    #endif

    /* TX Interrupt status mask */
    #define CAN_U16_USER_IE_GTINTSTS    (CAN_U16_USER_THIF | CAN_U16_USER_CFTIF | CAN_U16_USER_TAIF | CAN_U16_USER_TSIF)

    /* TX completion mask */
    #define CAN_U16_USER_IE_TMTCSTS     (CAN_U16_USER_TMIEC)
#endif

/* Settings of CAN0 Channel Error Interrupt */
#if (CAN_CFG_INTRCAN0ERR_USE != 0)
    #define CAN_U08_USER_IE_C0ERFLL     (CAN_U08_USER_C0CTRLH)
#endif

/**********************************************************************************************************************
 Local Typedef definitions
 *********************************************************************************************************************/

/**********************************************************************************************************************
 Exported global variables
 *********************************************************************************************************************/

/**********************************************************************************************************************
 Private (static) variables and functions
 *********************************************************************************************************************/
#define CAN_DLC_HIGHER_NUM          (8u)    /* Number of DLC 8 or more */
static const uint8_t s_dlc_to_length[CAN_DLC_HIGHER_NUM] =
{
/*  DLC:8   9    10   11   12   13   14   15  */
        8u, 12u, 16u, 20u, 24u, 32u, 48u, 64u
};

#if ((CAN_CFG_RF0_RFDC | CAN_CFG_RF1_RFDC) != 0)    /* Use RXFIFO? */
static const uint8_t s_rxfifo_pls[CAN_MAX_RXFIFO_NUM] =
{
    CAN_CFG_RF0_RFPLS, CAN_CFG_RF1_RFPLS
};
#endif

/**********************************************************************************************************************
 * Function Name: R_CAN_Create
 * Description  : This function initializes the CAN module.
 * Arguments    : None
 * Return Value : None
 *********************************************************************************************************************/
void R_CAN_Create(void)
{
    /* Clock supply */
    CAN0EN = 1u;        /* supply CAN input clock */

#if (BSP_CFG_PIOR46 == 0)
    /* Set P11 for CRXD0 pin (no PMCxx) */
    PM1_bit.no1    = 1u;                    /* Input mode */
    PU1_bit.no1    = CAN_CFG_CRXD0_PU;      /* On-chip pull-up resistor setting */
    PIM1_bit.no1   = 0u;                    /* Normal input buffer */
    POM1_bit.no1   = 0u;                    /* Normal output mode (not open-drain) */
    PITHL1_bit.no1 = CAN_CFG_CRXD0_PITHL;   /* Schmitt1 or Schmitt3 */

    /* Set P10 for CTXD0 pin (no PMCxx)  */
    P1_bit.no0     = 1u;                    /* Output 1 */
    PM1_bit.no0    = 0u;                    /* Output mode */
    POM1_bit.no0   = 0u;                    /* Normal output mode (not open-drain) */
    PSRSEL_bit.no0 = 0u;                    /* Normal slew rate */

#else
    /* Set P73 for CRXD0 pin */
    PMC7_bit.no3   = 0u;                    /* Digital I/O */
    PM7_bit.no3    = 1u;                    /* Input mode */
    PU7_bit.no3    = CAN_CFG_CRXD0_PU;      /* On-chip pull-up resistor setting */
    PIM7_bit.no3   = 0u;                    /* Normal input buffer */
    POM7_bit.no3   = 0u;                    /* Normal output mode (not open-drain) */
    PITHL7_bit.no3 = CAN_CFG_CRXD0_PITHL;   /* Schmitt1 or Schmitt3 */

    /* Set P72 for CTXD0 pin (no PSRSEL) */
    PMC7_bit.no2    = 0u;                   /* Digital I/O */
    P7_bit.no2      = 1u;                   /* Output 1 */
    PM7_bit.no2     = 0u;                   /* Output mode */
    POM7_bit.no2    = 0u;                   /* Normal output mode (not open-drain) */

#endif

    /* CAN Global Receive FIFO Interrupt */
    RCANGRFRMK = 1u;
    RCANGRFRIF = 0u;

    /* CAN Global Receive Message Buffer Interrupt */
    RCANGRVCMK = 1u;
    RCANGRVCIF = 0u;

    /* CAN Global Error Interrupt */
    RCANGERRMK = 1u;
    RCANGERRIF = 0u;

    /* CAN0 Channel Transmit Interrupt */
    RCAN0TRMMK = 1u;
    RCAN0TRMIF = 0u;

    /* CAN0 Common FIFO Receive Interrupt */
    RCAN0CFRMK = 1u;
    RCAN0CFRIF = 0u;

    /* CAN0 Channel Error Interrupt */
    RCAN0ERRMK = 1u;
    RCAN0ERRIF = 0u;

    /* CAN0 Wakeup Interrupt */
    RCAN0WUPMK = 1u;
    RCAN0WUPIF = 0u;

}
/**********************************************************************************************************************
 End of function R_CAN_Create
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_CAN_SetConfig
 * Description  : Initialize CAN controller after reset
 * Arguments    : none 
 * Return Value : CAN_SUCCESS - 
 *                    normal completion
 *                CAN_ERR_INVALID_MODE -
 *                    invalid global mode
 *                CAN_ERR_ILLEGAL_STS -
 *                    failure to change global mode or channel mode
 *********************************************************************************************************************/
e_can_err_t R_CAN_SetConfig(void)
{
    e_can_err_t  rtn;
    uint16_t     try_num;

    /* ==== Check if RAM initialization is finished ==== */
    rtn     = CAN_ERR_ILLEGAL_STS;
    try_num = 0u;
    do
    {
        if ((GSTS & CAN_U16_GSTS_GRAMINIT_ON) == 0u)                        /* RAM initialization is finished? */
        {
            rtn = CAN_SUCCESS;
        }
        else
        {
            try_num++;
        }
    }
    while ((CAN_SUCCESS != rtn) && (try_num < CAN_TRY_GLB_RAM_INIT));

