released/RL78_F24_CAN/src/smc_gen/r_rscanfd_rl78/r_rscanfd_rl78.c
    /* ==== global mode switch (sleep->reset) ==== */
    if (CAN_SUCCESS == rtn)
    {
        if ((GSTS & CAN_U16_GSTS_GSLPSTS_ON) != 0u)                        /* Global Sleep Mode? */
        {
            GCTRLL = CAN_U08_GCTRLL_RESET_MODE;

            rtn     = CAN_ERR_ILLEGAL_STS;
            try_num = 0u;
            do
            {
                if ((GSTS & CAN_U16_GSTS_GSLPSTS_ON) == 0u)                 /* Exit Sleep mode? */
                {
                    rtn = CAN_SUCCESS;
                }
                else
                {
                    try_num++;
                }
            }
            while ((CAN_SUCCESS != rtn) && (try_num < CAN_TRY_GLB_SLP_TO_RST));
        }
        else if ((GSTS & CAN_U16_GSTS_GRSTSTS_ON) == 0u)                    /* Not Global Reset Mode? */
        {
            rtn = CAN_ERR_INVALID_MODE;
        }
        else
        {
            ;   /* No operation if Global Reset Mode */
        }
    }
    else
    {
        ;   /* No operation if error has occured */
    }

    /* ==== channel mode switch (sleep->reset) ==== */
    if (CAN_SUCCESS == rtn)
    {
        if ((C0STSL & CAN_U16_C0STSL_CSLPSTS_ON) != 0u)                     /* Channel Sleep Mode? */
        {
            C0CTRLL = CAN_U08_C0CTRLL_RESET_MODE;

            rtn     = CAN_ERR_ILLEGAL_STS;
            try_num = 0u;
            do
            {
                if ((C0STSL & CAN_U16_C0STSL_CSLPSTS_ON) == 0u)             /* Exit Sleep mode? */
                {
                    rtn = CAN_SUCCESS;
                }
                else
                {
                    try_num++;
                }
            }
            while ((CAN_SUCCESS != rtn) && (try_num < CAN_TRY_CH_SLP_TO_RST));
        }
        else
        {
            ;   /* No operation if Channel Reset Mode */
        }
    }
    else
    {
        ;   /* No operation if error has occured */
    }

    if (CAN_SUCCESS == rtn)
    {
        /* ==== FD / Classical mode setting ==== */
        C0FDCFGHH = (uint8_t)(CAN_U16_BIT6(CAN_CFG_CLOE) | CAN_U16_BIT4(CAN_CFG_FDOE));

        /* ==== Global function setting ==== */
        GCFGH  = (uint16_t)CAN_CFG_ITRCP;
        GCFGL  = (
            CAN_U16_BIT12(CAN_CFG_TSSS)             |
            CAN_U16_POS8 (CAN_CFG_TSP, CAN_MASK_W4) |
            CAN_U16_BIT5 (CAN_CFG_CMPOC)            |
            CAN_U16_BIT4 (CAN_CFG_DCS)              |
            CAN_U16_BIT3 (CAN_CFG_MME)              |
            CAN_U16_BIT2 (CAN_CFG_DRE)              |
            CAN_U16_BIT1 (CAN_CFG_DCE)              |
            CAN_U16_BIT0 (CAN_CFG_TPRI));
        GFDCFG = (
            CAN_U16_POS8 (CAN_CFG_TSCCFG, CAN_MASK_W2) |
            CAN_U16_BIT0 (CAN_CFG_RPED));

        /* ==== Baud Rate and Bit Timing setting ==== */
        C0NCFGH = (
            CAN_U16_POS9 (CAN_CFG_NTSEG2,   CAN_MASK_W7) |
            CAN_U16_POS1 (CAN_CFG_NTSEG1,   CAN_MASK_W8) |
            CAN_U16_BIT0 (CAN_USER_NSJW6));
        C0NCFGL = (
            CAN_U16_POS10(CAN_USER_NSJW5_0, CAN_MASK_W6) |
            CAN_U16_POS0 (CAN_CFG_NBRP,     CAN_MASK_W10));
#if (CAN_CFG_CLOE == 0)                                                     /* Not Classical mode? */
        C0DCFGH = (
            CAN_U16_POS8(CAN_CFG_DSJW,   CAN_MASK_W4) |
            CAN_U16_POS0(CAN_CFG_DTSEG2, CAN_MASK_W4));
        C0DCFGL = (
            CAN_U16_POS8(CAN_CFG_DTSEG1, CAN_MASK_W5) |
            CAN_U16_POS0(CAN_CFG_DBRP,   CAN_MASK_W8));
#endif

        /* ==== Rx rule setting ==== */
        GAFLCFG = CAN_U08_CLR;

        /* ==== buffer setting ==== */
        /* ---- Set RX message buffer ---- */
        RMNB  = (
            CAN_U16_POS8(CAN_CFG_RMPLS, CAN_MASK_W3) |
            CAN_U16_POS0(CAN_CFG_NRXMB, CAN_MASK_W5));
        RMIEC = CAN_U16_USER_RMIEC_VAL & CAN_U16_USER_RMIEC_MASK;

        /* ---- Set Rx FIFO buffer ---- */
        RFCC0 = (
            CAN_U16_POS13(CAN_CFG_RF0_RFIGCV, CAN_MASK_W3) |
            CAN_U16_BIT12(CAN_CFG_RF0_RFIM)                |
            CAN_U16_POS8 (CAN_CFG_RF0_RFDC,   CAN_MASK_W2) | /* Max:11b */
            CAN_U16_POS4 (CAN_CFG_RF0_RFPLS,  CAN_MASK_W3) |
            CAN_U16_BIT1 (CAN_CFG_RF0_RFIE));
        RFCC1 = (
            CAN_U16_POS13(CAN_CFG_RF1_RFIGCV, CAN_MASK_W3) |
            CAN_U16_BIT12(CAN_CFG_RF1_RFIM)                |
            CAN_U16_POS8 (CAN_CFG_RF1_RFDC,   CAN_MASK_W2) | /* Max:11b */
            CAN_U16_POS4 (CAN_CFG_RF1_RFPLS,  CAN_MASK_W3) |
            CAN_U16_BIT1 (CAN_CFG_RF1_RFIE));

        /* ---- Set Common FIFO buffer ---- */
        CFCCH = (
            CAN_U16_POS8 (CAN_CFG_CFITT,  CAN_MASK_W8) |
            CAN_U16_POS5 (CAN_CFG_CFDC,   CAN_MASK_W2) | /* Max:11b */
            CAN_U16_POS0 (CAN_CFG_CFTML,  CAN_MASK_W2));
        CFCCL = (
            CAN_U16_POS13(CAN_CFG_CFIGCV, CAN_MASK_W3) |
            CAN_U16_BIT12(CAN_CFG_CFIM)                |
            CAN_U16_BIT11(CAN_CFG_CFITR)               |
            CAN_U16_BIT10(CAN_CFG_CFITSS)              |
            CAN_U16_BIT8 (CAN_CFG_CFM)                 |
            CAN_U16_POS4 (CAN_CFG_CFPLS,  CAN_MASK_W3) |
            CAN_U16_BIT2 (CAN_CFG_CFTXIE)              |
            CAN_U16_BIT1 (CAN_CFG_CFRXIE));

        /* ---- Set TX message buffer ---- */
        TMIEC = CAN_U16_USER_TMIEC;

        /* ---- Set TX history list ---- */
        THLCC = (
            CAN_U16_BIT10(CAN_CFG_THLDTE) |
            CAN_U16_BIT9 (CAN_CFG_THLIM)  |
            CAN_U16_BIT8 (CAN_CFG_THLIE));

        /* ==== global error interrupt setting ==== */
        GCTRLH = CAN_U08_USER_GCTRLH;

        /* ==== channel function setting (Not support SOCOIE,EOCOIE) ==== */
        C0CTRH  = (
            CAN_U16_BIT7(CAN_CFG_ERRD)             |
            CAN_U16_POS5(CAN_CFG_BOM, CAN_MASK_W2) |
            CAN_U16_BIT3(CAN_CFG_TDCVFIE)          |
            CAN_U16_BIT0(CAN_CFG_TAIE));
        C0CTRLH = CAN_U08_USER_C0CTRLH;

        /* ==== channel FD setting (Not support RPNMD,EOCCFG) ==== */
        C0FDCFGH |= (
            CAN_U16_BIT13(CAN_CFG_REFE) |
            CAN_U16_POS0 (CAN_CFG_TDCO, CAN_MASK_W8)); /* or CLOE/FDOE */
        C0FDCFGL  = (
            CAN_U16_BIT10(CAN_CFG_ESIC) |
            CAN_U16_BIT9 (CAN_CFG_TDCE) |
            CAN_U16_BIT8 (CAN_CFG_TDCOC));

        /* ==== Interrupt Priority Setting ==== */
        /* CAN Global Receive FIFO Interrupt */
        RCANGRFRPR1 = CAN_U08_GET_BIT1(CAN_CFG_INTRCANGRFR_LEVEL);
        RCANGRFRPR0 = CAN_U08_GET_BIT0(CAN_CFG_INTRCANGRFR_LEVEL);

        /* CAN Global Receive Message Buffer Interrupt */
        RCANGRVCPR1 = CAN_U08_GET_BIT1(CAN_CFG_INTRCANGRVC_LEVEL);
        RCANGRVCPR0 = CAN_U08_GET_BIT0(CAN_CFG_INTRCANGRVC_LEVEL);

