released/RL78_F24_CAN/src/smc_gen/r_rscanfd_rl78/r_rscanfd_rl78.c
        /* CAN Global Error Interrupt */
        RCANGERRPR1 = CAN_U08_GET_BIT1(CAN_CFG_INTRCANGERR_LEVEL);
        RCANGERRPR0 = CAN_U08_GET_BIT0(CAN_CFG_INTRCANGERR_LEVEL);

        /* CAN0 Channel Transmit Interrupt */
        RCAN0TRMPR1 = CAN_U08_GET_BIT1(CAN_CFG_INTRCAN0TRM_LEVEL);
        RCAN0TRMPR0 = CAN_U08_GET_BIT0(CAN_CFG_INTRCAN0TRM_LEVEL);

        /* CAN0 Common FIFO Receive Interrupt */
        RCAN0CFRPR1 = CAN_U08_GET_BIT1(CAN_CFG_INTRCAN0CFR_LEVEL);
        RCAN0CFRPR0 = CAN_U08_GET_BIT0(CAN_CFG_INTRCAN0CFR_LEVEL);

        /* CAN0 Channel Error Interrupt */
        RCAN0ERRPR1 = CAN_U08_GET_BIT1(CAN_CFG_INTRCAN0ERR_LEVEL);
        RCAN0ERRPR0 = CAN_U08_GET_BIT0(CAN_CFG_INTRCAN0ERR_LEVEL);

        /* CAN0 Wakeup Interrupt */
        RCAN0WUPPR1 = CAN_U08_GET_BIT1(CAN_CFG_INTRCAN0WUP_LEVEL);
        RCAN0WUPPR0 = CAN_U08_GET_BIT0(CAN_CFG_INTRCAN0WUP_LEVEL);
    }
    else
    {
        ;   /* No operation */
    }

    return rtn;
}
/**********************************************************************************************************************
 End of function R_CAN_SetConfig
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_CAN_AddRxRule
 * Description  : This function initializes RX rule table of CAN module.
 * Arguments    : p_filter -
 *                    Pointer to rule filter structure (ID, ID mask, RTR type, IDE type)
 *                p_callback-
 *                    Optional pointer to function called from RXIF or global
 *                    error interrupts.
 *                p_opt -
 *                    Pointer to rule filter options structure (RX label, Information label, DLC, Loopback).
 *                    DLC is effective if DLC check is enabled (DCE=1).
 *                    Loopback is effective if mirror mode is enabled (MME=1).
 *                    Set NULL if not use options.
 * Return Value : CAN_SUCCESS -
 *                    normal completion
 *                CAN_ERR_BUF_FULL -
 *                    Cannot add a rule (RX rule table is full.)
 *                CAN_ERR_INVALID_MODE -
 *                    Not in global reset mode (results from R_CAN_SetConfig())
 *                CAN_ERR_INVALID_ARG -
 *                    invalid argument specification
 *********************************************************************************************************************/
e_can_err_t R_CAN_AddRxRule(const st_can_filter_t * p_filter,
    const can_storage_t         storage,
    const can_rxbuf_t           rxbuf_idx,
    const st_can_filter_opt_t * p_opt)
{
    e_can_err_t rtn = CAN_SUCCESS;
    uint16_t    rule_num;

    /* Get rule number */
    rule_num = GAFLCFG;

    /* Check mode and limit */
    if ((GSTS & CAN_U16_GSTS_MODE_MASK) != CAN_U16_GSTS_GRSTSTS_ON) /* Not Global Reset Mode? */
    {
        rtn = CAN_ERR_INVALID_MODE;                                 /* Return: Invalid current mode */
    }
    else if ((C0STSL & CAN_U16_C0STSL_MODE_MASK) != CAN_U16_C0STSL_CRSTSTS_ON) /* Not Channel Reset Mode? */
    {
        rtn = CAN_ERR_INVALID_MODE;                                 /* Return: Invalid current mode */
    }
    else if (rule_num >= CAN_MAX_RXRULE_NUM)                        /* Rule nunber is max? */
    {
        rtn = CAN_ERR_BUF_FULL;                                     /* Return: Cannot add a rule */
    }
#if (CAN_CFG_PARAM_CHECKING_ENABLE == 1)
    else if (NULL == p_filter)                                      /* NULL pointer? */
    {
        rtn = CAN_ERR_INVALID_ARG;                                  /* Return: Invalid argument */
    }
#endif
    else
    {
        ;   /* No operation */
    }

#if (CAN_CFG_PARAM_CHECKING_ENABLE == 1)
    /* Check storage */
    if (CAN_SUCCESS == rtn)
    {
        can_storage_t mask_storage = 0u;
        uint8_t       rxbuf_num    = CAN_CFG_NRXMB;

    #if (CAN_CFG_NRXMB > 0)                                         /* Use RX buffer? */
        mask_storage |= CAN_STORE_RM;
    #endif
    #if (CAN_CFG_RF0_RFDC > 0)                                      /* Use RX FIFO0? */
        mask_storage |= CAN_STORE_RF0;
    #endif
    #if (CAN_CFG_RF1_RFDC > 0)                                      /* Use RX FIFO1? */
        mask_storage |= CAN_STORE_RF1;
    #endif
    #if ((CAN_CFG_CFDC > 0) && (CAN_CFG_CFM == CAN_CFM_RX_MODE))    /* Use RX mode CFIFO? */
        mask_storage |= CAN_STORE_CF;
    #endif

        if ((storage & mask_storage) != storage)                /* Store to unuse buffer? */
        {
            rtn = CAN_ERR_INVALID_ARG;                          /* Return: Invalid argument */
        }
        else if (((storage & CAN_STORE_RM) != 0u) && (rxbuf_idx >= rxbuf_num))
        {
            /* Argument error if store to unused RX buffer */
            rtn = CAN_ERR_INVALID_ARG;                          /* Return: Invalid argument */
        }
        else
        {
            ;   /* No operation */
        }
    }
#endif /* end of (CAN_CFG_PARAM_CHECKING_ENABLE == 1) */

    if (CAN_SUCCESS == rtn)
    {
        volatile st_can_rxrule_sfr_t CAN_NO_BIT_ACCESS * p_rxrule_sfr;

        uint16_t id_high;
        uint16_t mask_high;
        uint8_t  rm_storage;
        uint8_t  ifl_and_dlc;
        uint16_t label;

        /* Set IDH, IDHM */
        id_high   = (uint16_t)((p_filter->ID)      >> 16u);         /* Get high word of ID */
        mask_high = (uint16_t)((p_filter->ID_MASK) >> 16u);         /* Get high word of ID_MASK */

        /* Set RTR, RTRM */
        if (p_filter->RTR_TYPE < CAN_RTR_ANY_FRAME)                 /* Not any? (RTR=0 or 1) */
        {
            id_high   |= CAN_U16_BIT14(p_filter->RTR_TYPE);
            mask_high |= CAN_U16_GAFLM0H_GAFLRTRM_ON;
        }

        /* Set IDE, IDEM */
        if (p_filter->IDE_TYPE < CAN_IDE_ANY_FORMAT)                /* Not any? (IDE=0 or 1) */
        {
            id_high   |= CAN_U16_BIT15(p_filter->IDE_TYPE);
            mask_high |= CAN_U16_GAFLM0H_GAFLIDEM_ON;
        }

        /* Set RMV, RMDP */
        if ((storage & CAN_STORE_RM) != 0u)                         /* Store to RX buffer? */
        {
            /* Set value for 8 bit register */
            rm_storage = (uint8_t)(CAN_U08_GAFLP00LH_GAFLRMV_ON | rxbuf_idx);
        }
        else
        {
            rm_storage = 0u;
        }

        if (NULL != p_opt)                                          /* Use option? */
        {
            /* Set LB */
            if (CAN_AFL_LB_LOOPBACK == p_opt->LB)
            {
                id_high |= CAN_U16_GAFLID0H_GAFLLB_ON;
            }

            /* Set IFL1 */
            if ((p_opt->IFL & CAN_IFL_MSB) != 0u)
            {
                mask_high |= CAN_U16_GAFLM0H_GAFLIFL1_ON;
            }

            /* Set DLC, IFL0 */
            ifl_and_dlc = (uint8_t)(p_opt->DLC);

            if ((p_opt->IFL & CAN_IFL_LSB) != 0u)
            {
                /* Set value for 8 bit register */
                ifl_and_dlc = (uint8_t)(CAN_U08_GAFLP00LL_GAFLIFL0_ON | ifl_and_dlc);
            }

            /* Set PTR */
            label = p_opt->LBL;
        }
        else
        {
            ifl_and_dlc = 0u;
            label       = 0u;
        }

