released/RL78_F24_CAN/src/smc_gen/r_rscanfd_rl78/r_rscanfd_rl78.c
        /* ---- Set Rx rule number per channel (Increment) ---- */
        GAFLCFG = rule_num + 1u;

        /* ---- Set write enable of Rule table ---- */
        GAFLECTRH = CAN_U08_GAFLECTRH_AFLDAE_ON;

        /* ---- Select RAM window 0 ---- */
        CFDGRWC = CAN_U16_CFDGRWC_PAGE0;

        /* ---- Get pointer of RX rule register ---- */
        p_rxrule_sfr = &CAN_RXRULE_SFR.RxRule[rule_num];

        /* ---- Set a single Rx rule ---- */
        p_rxrule_sfr->IDL  = (uint16_t)(p_filter->ID & CAN_USHORT_MAX);         /* Get low word of ID */
        p_rxrule_sfr->IDH  = id_high;
        p_rxrule_sfr->ML   = (uint16_t)(p_filter->ID_MASK & CAN_USHORT_MAX);    /* Get low word of ID_MASK */
        p_rxrule_sfr->MH   = mask_high;
        p_rxrule_sfr->P0LL = ifl_and_dlc;
        p_rxrule_sfr->P0LH = rm_storage;
        p_rxrule_sfr->P0H  = label;
        p_rxrule_sfr->P1L  = (storage & (CAN_STORE_CF | CAN_STORE_RF1 | CAN_STORE_RF0));

        /* ---- Set write disable of Rule table ---- */
        GAFLECTRH = CAN_U08_CLR;
    }
    else
    {
        ;   /* No operation if error has occured */
    }

    return rtn;
}
/**********************************************************************************************************************
 End of function R_CAN_AddRxRule
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_CAN_StartComm
 * Description  : Start CAN communication
 * Arguments    : none
 * Return Value : CAN_SUCCESS -
 *                    normal completion
 *                CAN_ERR_WAITING -
 *                    wait to change global mode or channel mode
 *                CAN_ERR_INVALID_MODE -
 *                    invalid global mode or channel mode
 *                CAN_ERR_ILLEGAL_STS -
 *                    failure to change global mode or channel mode
 *********************************************************************************************************************/
e_can_err_t R_CAN_StartComm(void)
{
    e_can_err_t rtn = CAN_SUCCESS;
    uint16_t    try_num;

    /* Clear interrupt flag and mask (excluding CAN0 wakeup) */
    {
#if (CAN_CFG_INTRCANGRFR_USE != 0)
        /* CAN Global Receive FIFO */
        RCANGRFRIF = 0u;
        RCANGRFRMK = 0u;
#endif

#if (CAN_CFG_INTRCANGRVC_USE != 0)
        /* CAN Global Receive Message Buffer */
        RCANGRVCIF = 0u;
        RCANGRVCMK = 0u;
#endif

#if (CAN_CFG_INTRCANGERR_USE != 0)
        /* CAN Global Error */
        RCANGERRIF = 0u;
        RCANGERRMK = 0u;
#endif

#if (CAN_CFG_INTRCAN0TRM_USE != 0)
        /* CAN0 Channel Transmit */
        RCAN0TRMIF = 0u;
        RCAN0TRMMK = 0u;
#endif

#if (CAN_CFG_INTRCAN0CFR_USE != 0)
        /* CAN0 Common FIFO Receive */
        RCAN0CFRIF = 0u;
        RCAN0CFRMK = 0u;
#endif

#if (CAN_CFG_INTRCAN0ERR_USE != 0)
        /* CAN0 Channel Error */
        RCAN0ERRIF = 0u;
        RCAN0ERRMK = 0u;
#endif
    }

    /* ==== switch to global operation mode from global reset mode ==== */
    if ((GSTS & CAN_U16_GSTS_MODE_MASK) == CAN_U16_GSTS_GRSTSTS_ON)             /* Global Reset mode? */
    {
        GCTRLL = CAN_U08_GCTRLL_OP_MODE;

        rtn     = CAN_ERR_ILLEGAL_STS;
        try_num = 0u;
        do
        {
            if ((GSTS & CAN_U16_GSTS_GRSTSTS_ON) == 0u)                         /* Global Operation mode? */
            {
                rtn = CAN_SUCCESS;
            }
            else
            {
                try_num++;
            }
        }
        while ((CAN_SUCCESS != rtn) && (try_num < CAN_TRY_GLB_RST_TO_OP));
    }
    else if ((GSTS & CAN_U16_GSTS_GSLPSTS_ON) != 0u)                            /* Global Sleep mode? */
    {
        rtn = CAN_ERR_INVALID_MODE;
    }
    else
    {
        ;   /* No operation if already Global Operation Mode */
    }

    /* ---- switch to channel operation mode ---- */
    if (CAN_SUCCESS == rtn)
    {
        if ((C0STSL & CAN_U16_C0STSL_MODE_MASK) == CAN_U16_C0STSL_CRSTSTS_ON)   /* Channel Reset Mode? */
        {
            C0CTRLL = CAN_U08_C0CTRLL_OP_MODE;

            rtn     = CAN_ERR_WAITING;
            try_num = 0u;
            do
            {
                if ((C0STSL & CAN_U16_C0STSL_CRSTSTS_ON) == 0u)                 /* Channel Operation mode? */
                {
                    rtn = CAN_SUCCESS;
                }
                else
                {
                    try_num++;
                }
            }
            while ((CAN_SUCCESS != rtn) && (try_num < CAN_TRY_MIN_TIMES));
        }
        else if ((C0STSL & CAN_U16_C0STSL_CSLPSTS_ON) != 0u)                    /* Channel Sleep Mode? */
        {
            rtn = CAN_ERR_INVALID_MODE;
        }
        else
        {
            ;   /* No operation if already Channel Operation Mode */
        }
    }
    else
    {
        ;   /* No operation if error has ocurred */
    }

    /* ---- set fifo enable ---- */
#if ((CAN_CFG_RF0_RFDC | CAN_CFG_RF1_RFDC | CAN_CFG_CFDC | CAN_CFG_THLE) != 0)
    if (CAN_SUCCESS == rtn)
    {
    #if (CAN_CFG_RF0_RFDC != 0)
        RFCC0 |= CAN_U16_RFCC_RFE_ON;
    #endif

    #if (CAN_CFG_RF1_RFDC != 0)
        RFCC1 |= CAN_U16_RFCC_RFE_ON;
    #endif

    #if (CAN_CFG_CFDC != 0)
        CFCCL |= CAN_U16_CFCCL_CFE_ON;
    #endif

    #if (CAN_CFG_THLE != 0)
        THLCC |= CAN_U16_THLCC_THLE_ON;
    #endif
    }
#endif

    return rtn;
}
/**********************************************************************************************************************
 End of function R_CAN_StartComm
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_CAN_StopComm
 * Description  : Stop channel operation (Channel 0)
 * Arguments    : none
 * Return Value : CAN_SUCCESS -
 *                    normal completion
 *                CAN_ERR_WAITING -
 *                    wait to change global mode or channel mode
 *********************************************************************************************************************/
e_can_err_t R_CAN_StopComm(void)
{
    e_can_err_t rtn = CAN_SUCCESS;
    uint16_t    try_num;

    /* ---- switch to channel halt mode ---- */
    if ((C0STSL & (CAN_U16_C0STSL_CHLTSTS_ON | CAN_U16_C0STSL_CRSTSTS_ON)) == 0u)   /* Operation Mode? */
    {
        C0CTRLL = CAN_U08_C0CTRLL_HALT_MODE;

        rtn     = CAN_ERR_WAITING;
        try_num = 0u;
        do
        {
            if ((C0STSL & CAN_U16_C0STSL_CHLTSTS_ON) != 0u)                         /* Halt mode? */
            {
                rtn = CAN_SUCCESS;
            }
            else
            {
                try_num++;
            }
        }
        while ((CAN_SUCCESS != rtn) && (try_num < CAN_TRY_MIN_TIMES));
    }
    else
    {
        ;   /* No operation */
    }

    /* ---- disable CAN interrupt (excluding CAN0 wakeup) ---- */
    if (CAN_SUCCESS == rtn)                     /* Success of transition to Halt Mode? */
    {
        /* CAN Global Receive FIFO */
        RCANGRFRMK = 1u;
        RCANGRFRIF = 0u;

        /* CAN Global Receive Message Buffer */
        RCANGRVCMK = 1u;
        RCANGRVCIF = 0u;

        /* CAN Global Error */
        RCANGERRMK = 1u;
        RCANGERRIF = 0u;

