released/RL78_F24_CAN/src/smc_gen/r_rscanfd_rl78/r_rscanfd_rl78.c
        /* CAN0 Channel Transmit */
        RCAN0TRMMK = 1u;
        RCAN0TRMIF = 0u;

        /* CAN0 Common FIFO Receive */
        RCAN0CFRMK = 1u;
        RCAN0CFRIF = 0u;

        /* CAN0 Channel Error */
        RCAN0ERRMK = 1u;
        RCAN0ERRIF = 0u;
    }
    else
    {
        ;   /* No operation */
    }

    /* ---- switch to channel reset mode ---- */
    if (CAN_SUCCESS == rtn)
    {
        if ((C0STSL & CAN_U16_C0STSL_CRSTSTS_ON) == 0u)                         /* Not Reset Mode? */
        {
            C0CTRLL = CAN_U08_C0CTRLL_RESET_MODE;

            rtn     = CAN_ERR_WAITING;
            try_num = 0u;
            do
            {
                if ((C0STSL & CAN_U16_C0STSL_CRSTSTS_ON) != 0u)                         /* Reset mode? */
                {
                    rtn = CAN_SUCCESS;
                }
                else
                {
                    try_num++;
                }
            }
            while ((CAN_SUCCESS != rtn) && (try_num < CAN_TRY_MIN_TIMES));
        }
        else
        {
            ;   /* No operation if Channel Reset/Sleep Mode */
        }
    }
    else
    {
        ;   /* No operation */
    }

    /* ---- switch to global reset mode ---- */
    if (CAN_SUCCESS == rtn)
    {
        if ((GSTS & CAN_U16_GSTS_GRSTSTS_ON) == 0u)                         /* Not Global Reset Mode? */
        {
            GCTRLL = CAN_U08_GCTRLL_RESET_MODE;

            rtn     = CAN_ERR_WAITING;
            try_num = 0u;
            do
            {
                if ((GSTS & CAN_U16_GSTS_GRSTSTS_ON) != 0u)                             /* Global Reset mode? */
                {
                    rtn = CAN_SUCCESS;
                }
                else
                {
                    try_num++;
                }
            }
            while ((CAN_SUCCESS != rtn) && (try_num < CAN_TRY_MIN_TIMES));
        }
        else
        {
            ;   /* No operation if Global Reset/Sleep Mode */
        }
    }
    else
    {
        ;   /* No operation */
    }

    return rtn;
}
/**********************************************************************************************************************
 End of function R_CAN_StopComm
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_CAN_Sleep
 * Description  : Put CAN module to sleep
 * Arguments    : wup -
 *                    Whether to use CAN wakeup (CAN_WUP_UNUSE, CAN_WUP_USE)
 * Return Value : CAN_SUCCESS -
 *                    normal completion
 *                CAN_ERR_INVALID_MODE -
 *                    invalid global mode or channel mode
 *                CAN_ERR_ILLEGAL_STS -
 *                    failure to change global mode or channel mode
 *********************************************************************************************************************/
e_can_err_t R_CAN_Sleep(const uint8_t wup)
{
    e_can_err_t rtn = CAN_SUCCESS;
    uint16_t    try_num;

    /* ---- switch to channel sleep mode ---- */
    if ((C0STSL & CAN_U16_C0STSL_MODE_MASK) == CAN_U16_C0STSL_CRSTSTS_ON)   /* Channel Reset Mode? */
    {
        C0CTRLL = CAN_U08_C0CTRLL_SLEEP_MODE;

        rtn     = CAN_ERR_ILLEGAL_STS;
        try_num = 0u;
        do
        {
            if ((C0STSL & CAN_U16_C0STSL_CSLPSTS_ON) != 0u)                 /* Channel Sleep Mode? */
            {
                rtn = CAN_SUCCESS;
            }
            else
            {
                try_num++;
            }
        }
        while ((CAN_SUCCESS != rtn) && (try_num < CAN_TRY_CH_RST_TO_SLP));
    }
    else if ((C0STSL & CAN_U16_C0STSL_CSLPSTS_ON) == 0u)                    /* Not Channel Sleep Mode? */
    {
        rtn = CAN_ERR_INVALID_MODE;
    }
    else
    {
        ;   /* No operation if already Channel Sleep Mode */
    }

    /* ---- switch to global sleep mode ---- */
    if (CAN_SUCCESS == rtn)
    {
        if ((GSTS & CAN_U16_GSTS_MODE_MASK) == CAN_U16_GSTS_GRSTSTS_ON)     /* Global Reset Mode? */
        {
            GCTRLL = CAN_U08_GCTRLL_SLEEP_MODE;

            rtn     = CAN_ERR_ILLEGAL_STS;
            try_num = 0u;
            do
            {
                if ((GSTS & CAN_U16_GSTS_GSLPSTS_ON) != 0u)                 /* Global Sleep Mode? */
                {
                    rtn = CAN_SUCCESS;
                }
                else
                {
                    try_num++;
                }
            }
            while ((CAN_SUCCESS != rtn) && (try_num < CAN_TRY_GLB_RST_TO_SLP));
        }
        else if ((GSTS & CAN_U16_GSTS_GSLPSTS_ON) == 0u)                    /* Not Global Sleep Mode? */
        {
            rtn = CAN_ERR_INVALID_MODE;
        }
        else
        {
            ;   /* No operation if already Global Sleep Mode */
        }
    }
    else
    {
        ;   /* No operation if error has occured */
    }

    /* ---- CAN wakeup settings ---- */
    if (CAN_SUCCESS == rtn)
    {
        if (CAN_WUP_UNUSE == wup)
        {
            CAN0EN = 0u;        /* disable supply CAN input clock */
        }
        else
        {
            /* CAN0 Wakeup */
            RCAN0WUPIF = 0u;
#if (CAN_CFG_INTRCAN0WUP_USE != 0)
            RCAN0WUPMK = 0u;
#else
            RCAN0WUPMK = 1u;
#endif
        }
    }
    else
    {
        ;   /* No operation if error has occured */
    }

    return rtn;
}
/**********************************************************************************************************************
 End of function R_CAN_Sleep
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_CAN_SendByTXMB
 * Description  : Transmit a frame by TX message buffer (Channel 0)
 * Arguments    : txbuf_idx -
 *                    TX message buffer index
 *                p_frame -
 *                    pointer to frame to be transmitted
 * Return Value : CAN_SUCCESS -
 *                    normal completion
 *                CAN_ERR_BUF_BUSY -
 *                    TX message buffer is busy (failure to clear TX message buffer status)
 *                CAN_ERR_INVALID_ARG -
 *                    invalid argument specification
 *********************************************************************************************************************/
e_can_err_t R_CAN_SendByTXMB(const can_txbuf_t txbuf_idx,
    const st_can_tx_frame_t * p_frame)
{
    e_can_err_t rtn = CAN_SUCCESS;

