released/RL78_F24_CAN/src/smc_gen/r_rscanfd_rl78/r_rscanfd_rl78.c
    /* ----  Check TX message buffer index ---- */
    if (txbuf_idx >= CAN_MAX_TXBUF_NUM)
    {
        rtn = CAN_ERR_INVALID_ARG;
    }
    else
    {
#if (CAN_CFG_PARAM_CHECKING_ENABLE == 1)
        if (NULL == p_frame)
        {
            rtn = CAN_ERR_INVALID_ARG;
        }
    #if ((CAN_CFG_CFDC > 0) && (CAN_CFG_CFM == CAN_CFM_TX_MODE))        /* Use TX mode CFIFO? */
        else if ((can_txbuf_t)CAN_CFG_CFTML == txbuf_idx)
        {
            rtn = CAN_ERR_INVALID_ARG;
        }
    #endif
        else
        {
            ;   /* No operation */
        }
#endif
    }

    /* ---- Clear and check TX message buffer status ---- */
    if (CAN_SUCCESS == rtn)
    {
        /* Clear TX message buffer status */
        CAN_TM_SFR.TMSTSm[txbuf_idx] = CAN_U08_CLR;

        /* Check TX message buffer status */
        if (CAN_U08_CLR != CAN_TM_SFR.TMSTSm[txbuf_idx])                /* Not clear? */
        {
            rtn = CAN_ERR_BUF_BUSY;
        }
        else
        {
            ;   /* No operation */
        }
    }
    else
    {
        ;   /* No operation */
    }

    /* ---- Store message to tx buffer ---- */
    if (CAN_SUCCESS == rtn)
    {
        volatile st_can_msgbuf_sfr_t CAN_NO_BIT_ACCESS * p_msg_sfr;

        uint8_t  fdctr;
        uint8_t  length;
        uint8_t  word_cnt;
        uint16_t idh_mask;
        uint16_t rpage;

        /* ---- FDF/BRS/ESI ---- */
        if (p_frame->Head.Bits.FDCTR >= CAN_FDCTR_FD_NMNL)              /* FD frame? */
        {
            fdctr    = p_frame->Head.Bits.FDCTR;                        /* Set 4 to 7 */
            idh_mask = CAN_U16_TMIDH_RTR_OFF;                           /* Mask RTR */
        }
        else
        {
            fdctr    = CAN_FDCTR_CLASSICAL;                             /* Set 0 if FDCTR=0,1,2,3 */
            idh_mask = CAN_USHORT_MAX;                                  /* No Mask */
        }

        /* ---- Get Length ---- */
        if (p_frame->Head.Bits.DLC < CAN_CLASSICAL_MAX)                 /* DLC: 0 to 7? */
        {
            length = (uint8_t)(p_frame->Head.Bits.DLC);                 /* length=DLC */
        }
        else                                                            /* DLC: 8 or more? */
        {
            if (CAN_FDCTR_CLASSICAL == fdctr)                           /* Classical? */
            {
                length = CAN_CLASSICAL_MAX;                             /* Fixed 8 bytes */
            }
            else
            {
                length = s_dlc_to_length[(p_frame->Head.Bits.DLC - CAN_CLASSICAL_MAX)];
            }
        }

        /* ---- Clear length to 0 if Remote Frame ---- */
        if ((CAN_RTR_CLASSICAL_RMT == p_frame->Head.Bits.RTR) &&        /* Remote Frame? */
            (CAN_FDCTR_CLASSICAL   == fdctr))
        {
            length = 0u;                                                /* No data (remote frame) */
        }

        /* ---- Select RAM window 1 ---- */
        rpage   = CFDGRWC;
        CFDGRWC = CAN_U16_CFDGRWC_PAGE1;

        /* ---- Get pointer of message buffer register ---- */
        p_msg_sfr = &(CAN_RAM_MSG_SFR.TxBufMsg[txbuf_idx]);

        /* ---- Set frame info ---- */
        p_msg_sfr->IDL = 
            p_frame->Head.Word[CAN_TX_HEAD_WORD_IDL];                   /* IDL */
        p_msg_sfr->IDH = 
            (p_frame->Head.Word[CAN_TX_HEAD_WORD_IDH] &
            idh_mask);                                                  /* IDE,THLEN,RTR,IDH */
        p_msg_sfr->PTRHH = 
            (uint8_t)((uint8_t)(p_frame->Head.Bits.DLC) << CAN_POS_TMPTRHH_TMDLC); /* DLC */
        p_msg_sfr->FDCSTSLL = fdctr;                                    /* FDF,BRS,ESI */
        p_msg_sfr->FDCSTSLH = p_frame->Head.Bits.IFL;                   /* IFL */
        p_msg_sfr->FDCSTSH  = p_frame->Head.Bits.LBL;                   /* PTR */

        /* ---- Set frame data ---- */
        for (word_cnt = 0u; word_cnt < CAN_BYTE_TO_WORD(length); word_cnt++ )
        {
            p_msg_sfr->DF[word_cnt] = p_frame->Data.DW[word_cnt];
        }

        /* ---- Restore RAM window ---- */
        CFDGRWC = CAN_U16_CFDGRWC_KEY | rpage;

        /* ---- Set transmission request ---- */
        CAN_TM_SFR.TMCm[txbuf_idx] = CAN_U08_TMC_TMTR_ON;
    }
    else
    {
        ;   /* No operation */
    }

    return rtn;
}
/**********************************************************************************************************************
 End of function R_CAN_SendByTXMB
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_CAN_AbortTXMB
 * Description  : Abort a CAN transmission (Channel 0)
 * Arguments    : txbuf_idx -
 *                    TX message buffer index
 * Return Value : CAN_SUCCESS -
 *                    normal completion
 *                CAN_ERR_INVALID_ARG -
 *                    invalid argument specification
 *********************************************************************************************************************/
e_can_err_t R_CAN_AbortTXMB(const can_txbuf_t txbuf_idx)
{
    e_can_err_t rtn = CAN_SUCCESS;

    /* ----  Check TX message buffer index ---- */
    if (txbuf_idx >= CAN_MAX_TXBUF_NUM)
    {
        rtn = CAN_ERR_INVALID_ARG;
    }
#if (CAN_CFG_PARAM_CHECKING_ENABLE == 1)
    #if ((CAN_CFG_CFDC > 0) && (CAN_CFG_CFM == CAN_CFM_TX_MODE))    /* Use TX mode CFIFO? */
    else if ((can_txbuf_t)CAN_CFG_CFTML == txbuf_idx)
    {
        rtn = CAN_ERR_INVALID_ARG;
    }
    #endif
#endif
    else
    {
        /* ---- Set transmission abort request ---- */
        CAN_TM_SFR.TMCm[txbuf_idx] = CAN_U08_TMC_TMTAR_ON;
    }

    return rtn;
}
/**********************************************************************************************************************
 End of function R_CAN_AbortTXMB
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_CAN_GetTXMBResult
 * Description  : Read the result of transmission from TX message buffer (Channel 0)
 * Arguments    : txbuf_idx -
 *                    TX message buffer index
 * Return Value : CAN_TXB_TRANSMITTING -
 *                    Transmission is in progress
 *                    or no transmit request is present.
 *                CAN_TXB_ABORT_OVER -
 *                    Transmit abort has been completed.
 *                CAN_TXB_END -
 *                    Transmission has been completed
 *                    (without transmit abort request).
 *                CAN_TXB_END_WITH_ABORT -
 *                    Transmission has been completed
 *                    (with transmit abort request).
 *                CAN_TXB_ARG_ERROR -
 *                    invalid argument specification
 *********************************************************************************************************************/
e_can_txb_result_t R_CAN_GetTXMBResult(const can_txbuf_t txbuf_idx)
{
    e_can_txb_result_t result;

