released/RL78_F24_CAN/src/smc_gen/r_rscanfd_rl78/r_rscanfd_rl78.c
    /* ----  Check TX message buffer index ---- */
    if (txbuf_idx >= CAN_MAX_TXBUF_NUM)
    {
        result = CAN_TXB_ARG_ERROR;
    }
#if (CAN_CFG_PARAM_CHECKING_ENABLE == 1)
    #if ((CAN_CFG_CFDC > 0) && (CAN_CFG_CFM == CAN_CFM_TX_MODE))    /* Use TX mode CFIFO? */
    else if ((can_txbuf_t)CAN_CFG_CFTML == txbuf_idx)
    {
        result = CAN_TXB_ARG_ERROR;
    }
    #endif
#endif
    else
    {
        uint8_t tmtrf_value;

        /* Get TMTRF value */
        tmtrf_value = ((CAN_TM_SFR.TMSTSm[txbuf_idx] & CAN_U08_TMSTS_TMTRF_MASK) >> CAN_POS_TMSTS_TMTRF);

        /* Set return value */
        result = (e_can_txb_result_t)tmtrf_value;

        /* ---- Tx transmission completed/abort? ---- */
        if (CAN_TXB_TRANSMITTING != result)
        {
            /* Clear TX message buffer status */
            CAN_TM_SFR.TMSTSm[txbuf_idx] = CAN_U08_CLR;
        }
        else
        {
            ;   /* No operation */
        }
    }

    return result;
}
/**********************************************************************************************************************
 End of function R_CAN_GetTXMBResult
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_CAN_SendByCFIFO
 * Description  : This function checks to see if the Common FIFO is full.
 *                If not, the appropriate registers are loaded with the message
 *                and marked as ready to send.
 * Arguments    : p_frame
 *                    Pointer to structure containing message info to send
 * Return Value : CAN_SUCCESS
 *                    Successful
 *                CAN_ERR_BUF_FULL
 *                    Cannot send at this time (Common FIFO is full.)
 *                CAN_ERR_INVALID_ARG
 *                    An invalid value passed for one of the parameters.
 *********************************************************************************************************************/
e_can_err_t R_CAN_SendByCFIFO(const st_can_tx_frame_t * p_frame)
{
    e_can_err_t rtn;

#if ((CAN_CFG_CFDC == 0) || (CAN_CFG_CFM != CAN_CFM_TX_MODE))       /* Not use TX mode CFIFO? */
    {
        rtn = CAN_ERR_INVALID_ARG;
    }
#else
    {
        rtn = CAN_SUCCESS;

        /* ---- Check if Common FIFO is full ---- */
        if ((CFSTS & CAN_U16_CFSTS_CFFLL_ON) != 0u)
        {
            rtn = CAN_ERR_BUF_FULL;
        }
        else
        {
    #if (CAN_CFG_PARAM_CHECKING_ENABLE == 1)
            if (NULL == p_frame)
            {
                rtn = CAN_ERR_INVALID_ARG;
            }
    #endif
        }

        /* ---- Send message into Common FIFO if it is not full ---- */
        if (CAN_SUCCESS == rtn)
        {
            uint8_t  fdctr;
            uint8_t  length;
            uint8_t  word_cnt;
            uint16_t idh_mask;
            uint16_t rpage;

            /* ---- FDF/BRS/ESI ---- */
            if (p_frame->Head.Bits.FDCTR >= CAN_FDCTR_FD_NMNL)      /* FD frame? */
            {
                fdctr    = p_frame->Head.Bits.FDCTR;                /* Set 4 to 7 */
                idh_mask = CAN_U16_CFIDH_RTR_OFF;                   /* Mask RTR */
            }
            else
            {
                fdctr    = CAN_FDCTR_CLASSICAL;                     /* Set 0 if FDCTR=0,1,2,3 */
                idh_mask = CAN_USHORT_MAX;                          /* No Mask */
            }

            /* ---- Get Length ---- */
            if (p_frame->Head.Bits.DLC < CAN_CLASSICAL_MAX)         /* DLC: 0 to 7? */
            {
                length = p_frame->Head.Bits.DLC;                    /* length=DLC */
            }
            else                                                    /* DLC: 8 or more? */
            {
                if (CAN_FDCTR_CLASSICAL == fdctr)                   /* Classical? */
                {
                    length = CAN_CLASSICAL_MAX;                     /* Fixed 8 bytes */
                }
                else                                                /* CAN FD */
                {
                    length = s_dlc_to_length[(p_frame->Head.Bits.DLC - CAN_CLASSICAL_MAX)];
                }
            }

            /* ---- Clear length to 0 if Remote Frame ---- */
            if ((CAN_RTR_CLASSICAL_RMT == p_frame->Head.Bits.RTR) && /* Remote Frame? */
                (CAN_FDCTR_CLASSICAL   == fdctr))
            {
                length = 0u;                                        /* No data (remote frame) */
            }

            /* ---- Check length max ---- */
            if (length > s_dlc_to_length[CAN_CFG_CFPLS])
            {
                length = s_dlc_to_length[CAN_CFG_CFPLS];
            }

            /* ---- Select RAM window 1 ---- */
            rpage   = CFDGRWC;
            CFDGRWC = CAN_U16_CFDGRWC_PAGE1;

            /* ---- Set frame info ---- */
            CFIDL      = p_frame->Head.Word[CAN_TX_HEAD_WORD_IDL];  /* IDL */
            CFIDH      = (p_frame->Head.Word[CAN_TX_HEAD_WORD_IDH] &
                idh_mask);                                          /* IDE,THLEN,RTR,IDH */
            CFPTRHH    = (uint8_t)((uint8_t)(p_frame->Head.Bits.DLC) << CAN_POS_CFPTRHH_CFDLC); /* DLC */
            CFFDCSTSLL = fdctr;                                     /* FDF,BRS,ESI */
            CFFDCSTSLH = p_frame->Head.Bits.IFL;                    /* IFL */
            CFFDCSTSH  = p_frame->Head.Bits.LBL;                    /* PTR */

            /* ---- Set frame data ---- */
            for (word_cnt = 0u; word_cnt < CAN_BYTE_TO_WORD(length); word_cnt++ )
            {
                CAN_RAM_MSG_SFR.CFIFOMsg.DF[word_cnt] = p_frame->Data.DW[word_cnt];
            }

            /* ---- Restore RAM window ---- */
            CFDGRWC = CAN_U16_CFDGRWC_KEY | rpage;

            /* ---- Increment Tx/Rx FIFO buffer pointer ---- */
            CFPCTRL = CAN_U08_CFPCTRL_FIFO_INC;
        }
        else
        {
            ;   /* No operation */
        }
    }
#endif /* end of (CAN_CFG_CFDC == 0 || CAN_CFG_CFM != CAN_CFM_TX_MODE) */

    return rtn;
}
/**********************************************************************************************************************
 End of function R_CAN_SendByCFIFO
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_CAN_AbortCFIFO
 * Description  : Abort Common FIFO transmission (Channel 0)
 * Arguments    : none
 * Return Value : CAN_SUCCESS -
 *                    normal completion
 *                CAN_ERR_BUF_BUSY -
 *                    Common FIFO is busy (failure to set Common FIFO enable)
 *                CAN_ERR_INVALID_ARG -
 *                    invalid argument specification
 *********************************************************************************************************************/
e_can_err_t R_CAN_AbortCFIFO(void)
{
    e_can_err_t rtn;

#if (CAN_CFG_CFDC == 0)
    {
        rtn = CAN_ERR_INVALID_ARG;  /* Not use Common FIFO */
    }
#else
    {
        uint16_t    try_num;

        /* ---- Set disable ---- */
        CFCCLL &= CAN_U08_CFCCL_CFE_OFF;

