released/RL78_F24_CAN/src/smc_gen/r_rscanfd_rl78/r_rscanfd_rl78.c
        /* ---- Wait until FIFO is empty ---- */
        rtn     = CAN_ERR_BUF_BUSY;
        try_num = 0u;
        do
        {
            if ((CFSTS & CAN_U16_CFSTS_CFEMP_ON) != 0u)   /* Empty? */
            {
                rtn = CAN_SUCCESS;
            }
            else
            {
                try_num++;
            }
        }
        while ((CAN_SUCCESS != rtn) && (try_num < CAN_TRY_MIN_TIMES));

        /* ---- Clear FIFO interrupt flag and Message Lost ---- */
        CFSTSL = CAN_U08_CLR;

        /* ---- Set enable ---- */
        if (CAN_SUCCESS == rtn)
        {
            CFCCL |= CAN_U16_CFCCL_CFE_ON;
        }
    }
#endif /* end of (CAN_CFG_CFDC == 0) */

    return rtn;
}
/**********************************************************************************************************************
 End of function R_CAN_AbortCFIFO
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_CAN_ReadTxHistory
 * Description  : Read entry from TX history list
 * Arguments    : p_entry -
 *                    pointer to stored TX history list entry
 * Return Value : CAN_SUCCESS -
 *                    A TX history entry is successfully read out.
 *                CAN_SUCCESS_WITH_LOST -
 *                    A TX history entry is successfully read out (with entry lost).
 *                CAN_ERR_BUF_EMPTY -
 *                    No TX history entry is read out.
 *                CAN_ERR_INVALID_ARG -
 *                    invalid argument specification
 *********************************************************************************************************************/
e_can_err_t R_CAN_ReadTxHistory(st_can_txhist_t *p_entry)
{
    e_can_err_t rtn = CAN_SUCCESS;

#if (CAN_CFG_PARAM_CHECKING_ENABLE == 1)
    if (NULL == p_entry)
    {
        rtn = CAN_ERR_INVALID_ARG;
    }
    else
#endif
    {
        uint16_t thlsts_value;

        /* ----  Check if any unread entry is available in TX history list ---- */
        thlsts_value = THLSTS;

        if ((thlsts_value & CAN_U16_THLSTS_THLEMP_ON) != 0u)
        {
            rtn = CAN_ERR_BUF_EMPTY;
        }
        else if ((thlsts_value & CAN_U16_THLSTS_THLELT_ON) != 0u)
        {
            /* ---- Clear message lost flag ---- */
            THLSTSL = CAN_U08_THLSTSL_CLR_THLELT;

            /* ----  Set return value ---- */
            rtn = CAN_SUCCESS_WITH_LOST;
        }
        else
        {
            ;   /* No operation */
        }

        if (rtn != CAN_ERR_BUF_EMPTY)
        {
            uint16_t thlacc_value;
            uint16_t rpage;

            /* ---- Select RAM window 1 ---- */
            rpage   = CFDGRWC;
            CFDGRWC = CAN_U16_CFDGRWC_PAGE1;

            /* ---- Read TX history list entry ---- */
            thlacc_value = THLACC0L;
            p_entry->TS  = THLACC0H;
            p_entry->LBL = THLACC1L;
            p_entry->IFL = (THLACC1H & CAN_U16_THLACC1H_TIFL_MASK);

            /* ---- Restore RAM window ---- */
            CFDGRWC = CAN_U16_CFDGRWC_KEY | rpage;

            /* Get Tx buffer type and number */
            if ((thlacc_value & CAN_U16_THLACC0L_BT_MASK) == CAN_U16_THLACC0L_BT_CFIFO)
            {
                /* ----  Not read TX buffer index (CFIFO)  ---- */
                p_entry->txbuf_idx = CAN_TXBUF_NOT;
            }
            else
            {
                /* ----  Read TX buffer index ---- */
                p_entry->txbuf_idx = (thlacc_value & CAN_U16_THLACC0L_BN_MASK) >> CAN_POS_THLACC0L_BN;
            }

            /* ---- Increment TX history list entry pointer ---- */
            THLPCTRL = CAN_U08_THLPCTRL_LIST_INC;
        }
    }

    return rtn;
}
/**********************************************************************************************************************
 End of function R_CAN_ReadTxHistory
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_CAN_GetTDCResult
 * Description  : Read transceiver delay compensation result
 * Arguments    : none
 * Return Value : Transceiver delay compensation result (0 to 0xFF)
 *********************************************************************************************************************/
uint8_t R_CAN_GetTDCResult(void)
{
    return  C0FDSTSLL;
}
/**********************************************************************************************************************
 End of function R_CAN_GetTDCResult
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_CAN_ReadRXMB
 * Description  : Read message from RX message buffer
 * Arguments    : rxbuf_idx -
 *                    RX message buffer that receives frame
 *                p_frame -
 *                    pointer to stored frame position
 * Return Value : CAN_SUCCESS -
 *                    A frame is successfully read out.
 *                CAN_ERR_BUF_EMPTY -
 *                    No frame is read out.
 *                CAN_ERR_BUF_BUSY -
 *                    RX message buffer is busy (failure to clear Rx complete flag)
 *                CAN_ERR_OVERWRITE -
 *                    A frame is overwritten.
 *                CAN_ERR_INVALID_ARG -
 *                    invalid argument specification
 *********************************************************************************************************************/
e_can_err_t R_CAN_ReadRXMB(const can_rxbuf_t rxbuf_idx,
    st_can_rx_frame_t * p_frame,
    can_length_t      * p_length)
{
    e_can_err_t rtn;

