released/RL78_F24_CAN/src/smc_gen/r_rscanfd_rl78/r_rscanfd_rl78.c
#if (CAN_CFG_NRXMB == 0)
    {
        rtn = CAN_ERR_INVALID_ARG;  /* Not use RX Buffer */
    }
#else
    {
        uint16_t rmnd_pattern;

        /* ----  Check RX message buffer index ---- */
        if (rxbuf_idx >= (can_rxbuf_t)CAN_CFG_NRXMB)
        {
            rmnd_pattern = 0u;

            rtn = CAN_ERR_INVALID_ARG;
        }
    #if (CAN_CFG_PARAM_CHECKING_ENABLE == 1)
        else if ((NULL == p_frame) || (NULL == p_length))
        {
            rmnd_pattern = 0u;

            rtn = CAN_ERR_INVALID_ARG;
        }
    #endif
        else
        {
            /* Make 16bits pattern */
            rmnd_pattern = ((uint16_t)1u << rxbuf_idx);

            /* ---- Judge if new messages are available ---- */
            if ((RMND & rmnd_pattern) == 0u)
            {
                rtn = CAN_ERR_BUF_EMPTY;
            }
            else
            {
                /* ---- Clear Rx complete flag of corresponding RX message buffer ---- */
                RMND = (uint16_t)~rmnd_pattern;

                if ((RMND & rmnd_pattern) != 0u)
                {
                    rtn = CAN_ERR_BUF_BUSY;
                }
                else
                {
                    rtn = CAN_SUCCESS;
                }
            }
        }

        /* ---- Read out message from RX message buffer ---- */
        if (CAN_SUCCESS == rtn)
        {
            volatile st_can_msgbuf_sfr_t CAN_NO_BIT_ACCESS * p_msg_sfr;

            uint8_t  length;
            uint8_t  word_cnt;
            uint16_t rpage;

            /* ---- Select RAM window 2 or 3 ---- */
            rpage = CFDGRWC;
            if (rxbuf_idx < CAN_HALF_RXBUF_NUM)         /* RXBUF0, ..., RXBUF7 */
            {
                CFDGRWC = CAN_U16_CFDGRWC_PAGE2;
            }
            else                                        /* RXBUF8, ..., RXBUF15 */
            {
                CFDGRWC = CAN_U16_CFDGRWC_PAGE3;
            }

            /* ---- Get pointer of message buffer register ---- */
            p_msg_sfr = &(CAN_RAM_RM_MSG_SFR.RxBufMsg[rxbuf_idx % CAN_HALF_RXBUF_NUM]);

            /* ---- Read frame data ---- */
            p_frame->Head.Word[CAN_RX_HEAD_WORD_IDL] = p_msg_sfr->IDL;  /* IDL */
            p_frame->Head.Word[CAN_RX_HEAD_WORD_IDH] = p_msg_sfr->IDH;  /* IDE,RTR,IDH */

            p_frame->Head.Word[CAN_RX_HEAD_WORD_FDCTR] =
                (uint16_t)(p_msg_sfr->FDCSTSLL) & CAN_MASK_W3;          /* FDF/BRS/ESI */

            p_frame->Head.Bits.DLC = p_msg_sfr->PTRHH >> CAN_POS_RMPTRHH_RMDLC; /* DLC */
            p_frame->Head.Bits.IFL = p_msg_sfr->FDCSTSLH & CAN_MASK_W2; /* IFL */
            p_frame->Head.Bits.LBL = p_msg_sfr->FDCSTSH;                /* Label */
            p_frame->Head.Bits.TS  = p_msg_sfr->PTRL;                   /* Time Stamp */

            /* ---- Get Length ---- */
            if (p_frame->Head.Bits.DLC < CAN_CLASSICAL_MAX)             /* DLC: 0 to 7? */
            {
                length = p_frame->Head.Bits.DLC;                        /* length=DLC */
            }
            else                                                        /* DLC: 8 or more? */
            {
                if (CAN_FDF_CLASSICAL == p_frame->Head.Bits.FDF)        /* Classical? */
                {
                    length = CAN_CLASSICAL_MAX;                         /* Fixed 8 bytes */
                }
                else                                                    /* CAN FD */
                {
                    length = s_dlc_to_length[(p_frame->Head.Bits.DLC - CAN_CLASSICAL_MAX)];
                }
            }

            /* ---- Clear length to 0 if Remote Frame ---- */
            if ((CAN_RTR_CLASSICAL_RMT == p_frame->Head.Bits.RTR) &&    /* Remote Frame? */
                (CAN_FDF_CLASSICAL     == p_frame->Head.Bits.FDF))
            {
                length = 0u;                                            /* No data (remote frame) */
            }

            /* ---- Check length max ---- */
            if (length > s_dlc_to_length[CAN_CFG_RMPLS])
            {
                length = s_dlc_to_length[CAN_CFG_RMPLS];
            }

            /* ---- Set frame data and length ---- */
            for (word_cnt = 0u; word_cnt < CAN_BYTE_TO_WORD(length); word_cnt++ )
            {
                p_frame->Data.DW[word_cnt] = p_msg_sfr->DF[word_cnt];
            }
            *p_length = length;

            /* ---- Restore RAM window ---- */
            CFDGRWC = CAN_U16_CFDGRWC_KEY | rpage;

            /* ---- Judge if current message is overwritten ---- */
            if ((RMND & rmnd_pattern) != 0u)
            {
                rtn = CAN_ERR_OVERWRITE;
            }
        }
    }
#endif  /* end of (CAN_CFG_NRXMB == 0) */

    return rtn;
}
/**********************************************************************************************************************
 End of function R_CAN_ReadRXMB
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_CAN_ReadRXMBInHandler
 * Description  : Read message from RX message buffer (used in CAN_CFG_CALLBACK_GLB_RXBUF)
 * Arguments    : rxbuf_idx -
 *                    RX message buffer that receives frame
 *                p_frame -
 *                    pointer to stored frame position
 * Return Value : CAN_SUCCESS -
 *                    A frame is successfully read out.
 *                CAN_ERR_OVERWRITE -
 *                    A frame is overwritten.
 *                CAN_ERR_INVALID_ARG -
 *                    invalid argument specification
 *********************************************************************************************************************/
#if (CAN_CFG_INTRCANGRVC_USE != 0)
e_can_err_t R_CAN_ReadRXMBInHandler(const can_rxbuf_t rxbuf_idx,
    st_can_rx_frame_t * p_frame,
    can_length_t      * p_length)
{
    e_can_err_t rtn;

