released/RL78_F24_CAN/src/smc_gen/r_rscanfd_rl78/r_rscanfd_rl78.c
    #if (CAN_CFG_NRXMB == 0)
    {
        rtn = CAN_ERR_INVALID_ARG;  /* Not use RX Buffer */
    }
    #else
    {
        volatile st_can_msgbuf_sfr_t CAN_NO_BIT_ACCESS * p_msg_sfr;

        uint8_t  length;
        uint8_t  word_cnt;
        uint16_t rpage;

        /* ----  Check RX message buffer index ---- */
        if (rxbuf_idx >= (can_rxbuf_t)CAN_CFG_NRXMB)
        {
            rtn = CAN_ERR_INVALID_ARG;
        }
    #if (CAN_CFG_PARAM_CHECKING_ENABLE == 1)
        else if ((NULL == p_frame) || (NULL == p_length))
        {
            rtn = CAN_ERR_INVALID_ARG;
        }
    #endif
        else
        {
            rtn = CAN_SUCCESS;

            /* ---- Select RAM window 2 or 3 ---- */
            rpage = CFDGRWC;
            if (rxbuf_idx < CAN_HALF_RXBUF_NUM)         /* RXBUF0, ..., RXBUF7 */
            {
                CFDGRWC = CAN_U16_CFDGRWC_PAGE2;
            }
            else                                        /* RXBUF8, ..., RXBUF15 */
            {
                CFDGRWC = CAN_U16_CFDGRWC_PAGE3;
            }

            /* ---- Get pointer of message buffer register ---- */
            p_msg_sfr = &(CAN_RAM_RM_MSG_SFR.RxBufMsg[rxbuf_idx % CAN_HALF_RXBUF_NUM]);

            /* ---- Read frame data ---- */
            p_frame->Head.Word[CAN_RX_HEAD_WORD_IDL] = p_msg_sfr->IDL;      /* IDL */
            p_frame->Head.Word[CAN_RX_HEAD_WORD_IDH] = p_msg_sfr->IDH;      /* IDE,RTR,IDH */

            p_frame->Head.Word[CAN_RX_HEAD_WORD_FDCTR] =
                (uint16_t)(p_msg_sfr->FDCSTSLL) & CAN_MASK_W3;              /* FDF/BRS/ESI */

            p_frame->Head.Bits.DLC = p_msg_sfr->PTRHH >> CAN_POS_RMPTRHH_RMDLC; /* DLC */
            p_frame->Head.Bits.IFL = p_msg_sfr->FDCSTSLH & CAN_MASK_W2;     /* IFL */
            p_frame->Head.Bits.LBL = p_msg_sfr->FDCSTSH;                    /* Label */
            p_frame->Head.Bits.TS  = p_msg_sfr->PTRL;                       /* Time Stamp */

            /* ---- Get Length ---- */
            if (p_frame->Head.Bits.DLC < CAN_CLASSICAL_MAX)     /* DLC: 0 to 7? */
            {
                length = p_frame->Head.Bits.DLC;                /* length=DLC */
            }
            else                                                /* DLC: 8 or more? */
            {
                if (CAN_FDF_CLASSICAL == p_frame->Head.Bits.FDF) /* Classical? */
                {
                    length = CAN_CLASSICAL_MAX;                 /* Fixed 8 bytes */
                }
                else
                {
                    length = s_dlc_to_length[(p_frame->Head.Bits.DLC - CAN_CLASSICAL_MAX)];
                }
            }

            /* ---- Clear length to 0 if Remote Frame ---- */
            if ((CAN_RTR_CLASSICAL_RMT == p_frame->Head.Bits.RTR) &&        /* Remote Frame? */
                (CAN_FDF_CLASSICAL     == p_frame->Head.Bits.FDF))
            {
                length = 0u;                                                /* No data (remote frame) */
            }

            /* ---- Check length max ---- */
            if (length > s_dlc_to_length[CAN_CFG_RMPLS])
            {
                length = s_dlc_to_length[CAN_CFG_RMPLS];
            }

            /* ---- Set frame data and length ---- */
            for (word_cnt = 0u; word_cnt < CAN_BYTE_TO_WORD(length); word_cnt++ )
            {
                p_frame->Data.DW[word_cnt] = p_msg_sfr->DF[word_cnt];
            }
            *p_length = length;

            /* ---- Restore RAM window ---- */
            CFDGRWC = CAN_U16_CFDGRWC_KEY | rpage;

            /* ---- Judge if current message is overwritten ---- */
            if ((RMND & ((uint16_t)1u << rxbuf_idx)) != 0u)
            {
                rtn = CAN_ERR_OVERWRITE;
            }
        }
    }
    #endif  /* end of (CAN_CFG_NRXMB == 0) */

    return rtn;
}
#endif /* end of (CAN_CFG_INTRCANGRVC_USE != 0) */
/**********************************************************************************************************************
 End of function R_CAN_ReadRXMBInHandler
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_CAN_ReadRXFIFO
 * Description  : Read message from RXFIFO
 * Arguments    : p_frame -
 *                    pointer to stored frame position
 * Return Value : CAN_SUCCESS -
 *                    A frame is successfully read out.
 *                CAN_SUCCESS_WITH_LOST -
 *                    A frame is successfully read out (with message lost).
 *                CAN_ERR_BUF_EMPTY -
 *                    No frame is read out.
 *                CAN_ERR_INVALID_ARG -
 *                    invalid argument specification
 *********************************************************************************************************************/
e_can_err_t R_CAN_ReadRXFIFO(const can_rxfifo_t rxfifo_idx,
    st_can_rx_frame_t * p_frame,
    can_length_t      * p_length)
{
    e_can_err_t rtn = CAN_SUCCESS;

#if ((CAN_CFG_RF0_RFDC | CAN_CFG_RF1_RFDC) == 0)    /* Not use RXFIFO? */
    {
        rtn = CAN_ERR_INVALID_ARG;
    }
#else
    {
        /* ----  Check RX FIFO index ---- */
        if (rxfifo_idx >= CAN_MAX_RXFIFO_NUM)
        {
            rtn = CAN_ERR_INVALID_ARG;
        }
        else
        {
    #if (CAN_CFG_PARAM_CHECKING_ENABLE == 1)
            if ((NULL == p_frame) || (NULL == p_length))
            {
                rtn = CAN_ERR_INVALID_ARG;
            }
        #if (CAN_CFG_RF0_RFDC == 0)
            else if (CAN_RXFIFO0 == rxfifo_idx)
            {
                rtn = CAN_ERR_INVALID_ARG;
            }
        #endif
        #if (CAN_CFG_RF1_RFDC == 0)
            else if (CAN_RXFIFO1 == rxfifo_idx)
            {
                rtn = CAN_ERR_INVALID_ARG;
            }
        #endif
            else
            {
                ;   /* No operation */
            }
    #endif
        }

        if (CAN_SUCCESS == rtn)
        {
            uint16_t rfsts_value;

            /* ----  Check if any unread message is available in Rx FIFO ---- */
            rfsts_value = CAN_RF_SFR.RFSTSk[rxfifo_idx].U16Reg.LowWord;

            if ((rfsts_value & CAN_U16_RFSTS_RFEMP_ON) != 0u)       /* FIFO Empty? */
            {
                rtn = CAN_ERR_BUF_EMPTY;
            }
            else
            {
                /* ---- Check if Rx FIFO has message lost ---- */
                if ((rfsts_value & CAN_U16_RFSTS_RFMLT_ON) != 0u)   /* Message Lost? */
                {
                    /* ---- Clear message lost flag ---- */
                    CAN_RF_SFR.RFSTSk[rxfifo_idx].U08Reg.LByte = CAN_U08_RFSTSL_CLR_RFMLT;

                    /* ----  Set return value ---- */
                    rtn = CAN_SUCCESS_WITH_LOST;
                }
            }
        }

        /* ---- Read out message from Rx FIFO ---- */
        if ((CAN_SUCCESS == rtn) || (CAN_SUCCESS_WITH_LOST == rtn))
        {
            volatile st_can_msgbuf_sfr_t CAN_NO_BIT_ACCESS * p_msg_sfr;

            uint8_t  length;
            uint8_t  rxfifo_pls;
            uint8_t  word_cnt;
            uint16_t rpage;

            /* ---- Select RAM window 1 ---- */
            rpage   = CFDGRWC;
            CFDGRWC = CAN_U16_CFDGRWC_PAGE1;

            /* ---- Get pointer of message buffer register ---- */
            p_msg_sfr = &(CAN_RAM_MSG_SFR.RxFIFOMsg[rxfifo_idx]);

            /* ---- Read frame data ---- */
            p_frame->Head.Word[CAN_RX_HEAD_WORD_IDL] = p_msg_sfr->IDL;      /* IDL */
            p_frame->Head.Word[CAN_RX_HEAD_WORD_IDH] = p_msg_sfr->IDH;      /* IDE,RTR,IDH */

