released/RL78_F24_CAN/src/smc_gen/r_rscanfd_rl78/r_rscanfd_rl78.c
            p_frame->Head.Word[CAN_RX_HEAD_WORD_FDCTR] =
                (uint16_t)(p_msg_sfr->FDCSTSLL) & CAN_MASK_W3;              /* FDF/BRS/ESI */

            p_frame->Head.Bits.DLC = p_msg_sfr->PTRHH >> CAN_POS_RFPTRHH_RFDLC; /* DLC */
            p_frame->Head.Bits.IFL = p_msg_sfr->FDCSTSLH & CAN_MASK_W2;     /* IFL */
            p_frame->Head.Bits.LBL = p_msg_sfr->FDCSTSH;                    /* Label */
            p_frame->Head.Bits.TS  = p_msg_sfr->PTRL;                       /* Time Stamp */

            /* ---- Get Length ---- */
            if (p_frame->Head.Bits.DLC < CAN_CLASSICAL_MAX)                 /* DLC: 0 to 7? */
            {
                length = p_frame->Head.Bits.DLC;                            /* length=DLC */
            }
            else                                                            /* DLC: 8 or more? */
            {
                if (CAN_FDF_CLASSICAL == p_frame->Head.Bits.FDF)            /* Classical? */
                {
                    length = CAN_CLASSICAL_MAX;                             /* Fixed 8 bytes */
                }
                else
                {
                    length = s_dlc_to_length[(p_frame->Head.Bits.DLC - CAN_CLASSICAL_MAX)];
                }
            }

            /* ---- Check length max ---- */
            rxfifo_pls = s_rxfifo_pls[rxfifo_idx];
            if (length > s_dlc_to_length[rxfifo_pls])
            {
                length = s_dlc_to_length[rxfifo_pls];
            }

            /* ---- Clear length to 0 if Remote Frame ---- */
            if ((CAN_RTR_CLASSICAL_RMT == p_frame->Head.Bits.RTR) &&        /* Remote Frame? */
                (CAN_FDF_CLASSICAL     == p_frame->Head.Bits.FDF))
            {
                length = 0u;                                                /* No data (remote frame) */
            }

            /* ---- Set frame data and length ---- */
            for (word_cnt = 0u; word_cnt < CAN_BYTE_TO_WORD(length); word_cnt++ )
            {
                p_frame->Data.DW[word_cnt] = p_msg_sfr->DF[word_cnt];
            }
            *p_length = length;

            /* ---- Restore RAM window ---- */
            CFDGRWC = CAN_U16_CFDGRWC_KEY | rpage;

            /* ---- Increment Rx FIFO buffer pointer ---- */
            CAN_RF_SFR.RFPCTRk[rxfifo_idx].U08Reg.LByte = CAN_U08_RFPCTRL_FIFO_INC;

        }
    }
#endif  /* end of ((CAN_CFG_RF0_RFDC | CAN_CFG_RF1_RFDC) == 0) */

    return rtn;
}
/**********************************************************************************************************************
 End of function R_CAN_ReadRXFIFO
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_CAN_ReadCFIFO
 * Description  : Read message from Common FIFO (Channel 0)
 * Arguments    : p_frame -
 *                    pointer to stored frame position
 *                p_length -
 *                    pointer to stored frame length
 * Return Value : CAN_SUCCESS -
 *                    A frame is successfully read out.
 *                CAN_SUCCESS_WITH_LOST -
 *                    A frame is successfully read out (with message lost).
 *                CAN_ERR_BUF_EMPTY -
 *                    No frame is read out.
 *                CAN_ERR_INVALID_ARG -
 *                    invalid argument specification
 *********************************************************************************************************************/
e_can_err_t R_CAN_ReadCFIFO(st_can_rx_frame_t * p_frame,
    can_length_t * p_length)
{
    e_can_err_t rtn;

#if ((CAN_CFG_CFDC == 0) || (CAN_CFG_CFM != CAN_CFM_RX_MODE))   /* Not use RX mode CFIFO? */
    {
        rtn = CAN_ERR_INVALID_ARG;
    }
#else
    {
        uint16_t    cfsts_value;

        rtn = CAN_SUCCESS;

    #if (CAN_CFG_PARAM_CHECKING_ENABLE == 1)
        if ((NULL == p_frame) || (NULL == p_length))
        {
            rtn = CAN_ERR_INVALID_ARG;
        }
        else
    #endif
        {
            /* ----  Check if any unread message is available in Common FIFO ---- */
            cfsts_value = CFSTS;

            if ((cfsts_value & CAN_U16_CFSTS_CFEMP_ON) != 0u)
            {
                rtn = CAN_ERR_BUF_EMPTY;
            }
            else if ((cfsts_value & CAN_U16_CFSTS_CFMLT_ON) != 0u)
            {
                /* ---- Clear message lost flag ---- */
                CFSTSL = CAN_U08_CFSTSL_CLR_CFMLT;

                /* ----  Set return value ---- */
                rtn = CAN_SUCCESS_WITH_LOST;
            }
            else
            {
                ;   /* No operation */
            }
        }

        /* ---- Read out message from Common FIFO ---- */
        if ((CAN_SUCCESS == rtn) || (CAN_SUCCESS_WITH_LOST == rtn))
        {
            uint8_t  length;
            uint8_t  word_cnt;
            uint16_t rpage;

            /* ---- Select RAM window 1 ---- */
            rpage   = CFDGRWC;
            CFDGRWC = CAN_U16_CFDGRWC_PAGE1;

            /* ---- Read frame data ---- */
            p_frame->Head.Word[CAN_RX_HEAD_WORD_IDL]   = CFIDL; /* IDL */
            p_frame->Head.Word[CAN_RX_HEAD_WORD_IDH]   = CFIDH; /* IDE,RTR,IDH */

            p_frame->Head.Word[CAN_RX_HEAD_WORD_FDCTR] =
                (uint16_t)CFFDCSTSLL & CAN_MASK_W3;             /* FDF/BRS/ESI */

            p_frame->Head.Bits.DLC = CFPTRHH >> CAN_POS_CFPTRHH_CFDLC; /* DLC */
            p_frame->Head.Bits.IFL = CFFDCSTSLH & CAN_MASK_W2;  /* IFL */
            p_frame->Head.Bits.LBL = CFFDCSTSH;                 /* Label */
            p_frame->Head.Bits.TS  = CFPTRL;                    /* Time Stamp */

            /* ---- Get Length ---- */
            if (p_frame->Head.Bits.DLC < CAN_CLASSICAL_MAX)     /* DLC: 0 to 7? */
            {
                length = p_frame->Head.Bits.DLC;                /* length=DLC */
            }
            else                                                /* DLC: 8 or more? */
            {
                if (CAN_FDF_CLASSICAL == p_frame->Head.Bits.FDF) /* Classical? */
                {
                    if (CAN_RTR_DATA_FRAME == p_frame->Head.Bits.RTR) /* Data Frame? */
                    {
                        length = CAN_CLASSICAL_MAX;             /* Fixed 8 bytes */
                    }
                    else
                    {
                        length = 0u;                            /* No data (remote frame) */
                    }
                }
                else
                {
                    length = s_dlc_to_length[(p_frame->Head.Bits.DLC - CAN_CLASSICAL_MAX)];
                }
            }

