released/RL78_F24_CAN/src/smc_gen/r_rscanfd_rl78/r_rscanfd_rl78.c
            /* ---- Clear length to 0 if Remote Frame ---- */
            if ((CAN_RTR_CLASSICAL_RMT == p_frame->Head.Bits.RTR) &&        /* Remote Frame? */
                (CAN_FDF_CLASSICAL     == p_frame->Head.Bits.FDF))
            {
                length = 0u;                                                /* No data (remote frame) */
            }

            /* ---- Check length max ---- */
            if (length > s_dlc_to_length[CAN_CFG_CFPLS])
            {
                length = s_dlc_to_length[CAN_CFG_CFPLS];
            }

            /* ---- Set frame data and length ---- */
            for (word_cnt = 0u; word_cnt < CAN_BYTE_TO_WORD(length); word_cnt++ )
            {
                p_frame->Data.DW[word_cnt] = CAN_RAM_MSG_SFR.CFIFOMsg.DF[word_cnt];
            }
            *p_length = length;

            /* ---- Restore RAM window ---- */
            CFDGRWC = CAN_U16_CFDGRWC_KEY | rpage;

            /* ---- Increment Tx/Rx FIFO buffer pointer ---- */
            CFPCTRL = CAN_U08_CFPCTRL_FIFO_INC;
        }
        else
        {
            ;   /* No operation */
        }
    }
#endif /* end of (CAN_CFG_CFDC == 0 || CAN_CFG_CFM != CAN_CFM_RX_MODE) */

    return rtn;
}
/**********************************************************************************************************************
 End of function R_CAN_ReadCFIFO
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_CAN_GetChStatus
 * Description  : Read channel status (Channel 0)
 * Arguments    : none
 * Return Value : channel status (<= 0x1FF) -
 *                    normal completion
 *********************************************************************************************************************/
uint16_t R_CAN_GetChStatus(void)
{
    uint16_t    ch_sts_value;

    ch_sts_value = C0STSL;

    if ((ch_sts_value & CAN_U16_C0STSL_ESIF_ON) != 0u)
    {
        C0STSLH = CAN_U08_CLR;
    }
    else
    {
        ;   /* No operation if ESIF=0 */
    }

    return ch_sts_value;
}
/**********************************************************************************************************************
 End of function R_CAN_GetChStatus
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_CAN_GetChBusErrFlag
 * Description  : Read channel bus error flags (Channel 0)
 * Arguments    : none
 * Return Value : channel bus error flags
 *********************************************************************************************************************/
uint8_t R_CAN_GetChBusErrFlag(void)
{
    uint8_t ch_erfl_lh_value;

    /* Read channel 0 error flag register (LH byte) */
    ch_erfl_lh_value = C0ERFLLH;

    /* Clear channel 0 error flag (ADERR, B0ERR, B1ERR, CERR, AFERR, FERR, SERR) */
    C0ERFLLH = (~ch_erfl_lh_value) & CAN_MASK_W7;

    return ch_erfl_lh_value;
}
/**********************************************************************************************************************
 End of function R_CAN_ReadChBusErrFlag
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_CAN_GetTSCounter
 * Description  : Return the timestamp counter value at that time
 * Arguments    : none
 * Return Value : Timestamp counter value (0 to 0xFFFF)
 *********************************************************************************************************************/
uint16_t R_CAN_GetTSCounter(void)
{
    return GTSC;
}
/**********************************************************************************************************************
 End of function R_CAN_GetTSCounter
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_CAN_GetVersion
 * Description  : Returns the version of this module.
 * Arguments    : none
 * Return Value : Version number (upper 8bits: Major version, lower 8bits: Minor version)
 *********************************************************************************************************************/
uint16_t R_CAN_GetVersion(void)
{
    return ((CAN_VERSION_MAJOR << CAN_POS_MAJOR_VER) | CAN_VERSION_MINOR);
}
/**********************************************************************************************************************
 End of function R_CAN_GetVersion
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: r_can_glb_rxfifo_isr
 * Description  : This function is executed when the INTRCANGRFR interrupt is received.
 * Arguments    : none
 * Return Value : none
 *********************************************************************************************************************/
#if (CAN_CFG_INTRCANGRFR_USE != 0)
R_BSP_PRAGMA_STATIC_INTERRUPT (r_can_glb_rxfifo_isr, CAN_INTRCANGRFR_VECT)
R_BSP_ATTRIB_STATIC_INTERRUPT void r_can_glb_rxfifo_isr(void)
{
    uint16_t  i_sources;
    uint16_t  rfists_value;

    i_sources = CAN_SOURCE_NOTHING;

    /* Read RX FIFO interrupt flag status */
    rfists_value = RFISTS & CAN_U16_USER_IE_RFISTS;

    /* Set interrupt sources and clear interrupt flags */
    while (0u != rfists_value)
    {
        /* Clear FIFO interrupt flag of RX FIFOs */
        if ((rfists_value & CAN_SOURCE_RECV_RF0) != 0u)
        {
            RFSTS0L = CAN_U08_RFSTSL_CLR_RFIF;
        }

        if ((rfists_value & CAN_SOURCE_RECV_RF1) != 0u)
        {
            RFSTS1L = CAN_U08_RFSTSL_CLR_RFIF;
        }

