released/RL78_F24_CAN/src/smc_gen/r_rscanfd_rl78/r_rscanfd_rl78.c
        /* Set interrupt source (Receive RX FIFO0, FIFO1) */
        i_sources |= rfists_value;

        /* Read RX FIFO interrupt flag status again */
        rfists_value = RFISTS & CAN_U16_USER_IE_RFISTS;
    }

    /* Call the user callback function */
    CAN_CFG_CALLBACK_GLB_RXFIFO(i_sources);
}
#endif /* end of (CAN_CFG_INTRCANGRFR_USE != 0) */
/**********************************************************************************************************************
 End of function r_can_glb_rxfifo_isr
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: r_can_glb_rxmb_isr
 * Description  : This function is executed when the INTRCANGRVC interrupt is received.
 * Arguments    : none
 * Return Value : none
 *********************************************************************************************************************/
#if (CAN_CFG_INTRCANGRVC_USE != 0)
R_BSP_PRAGMA_STATIC_INTERRUPT (r_can_glb_rxmb_isr, CAN_INTRCANGRVC_VECT)
R_BSP_ATTRIB_STATIC_INTERRUPT void r_can_glb_rxmb_isr(void)
{
    uint16_t  i_sources;
    uint16_t  rmnd_value;

    i_sources = CAN_SOURCE_NOTHING;

    /* Read RX buffer new data register */
    rmnd_value = RMND & CAN_U16_USER_IE_RMND;

    /* Set interrupt sources and clear interrupt flags */
    while (0u != rmnd_value)
    {
        /* Set interrupt source (Receive RX buffers) */
        i_sources |= rmnd_value;

        /* Clear new data flags which generate interrupt */
        RMND = ~rmnd_value;

        /* Read RX buffer new data register again */
        rmnd_value = RMND & CAN_U16_USER_IE_RMND;
    }

    /* Call the user callback function */
    CAN_CFG_CALLBACK_GLB_RXMB(i_sources);
}
#endif /* end of (CAN_CFG_INTRCANGRVC_USE != 0) */
/**********************************************************************************************************************
 End of function r_can_glb_rxmb_isr
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: r_can_glb_error_isr
 * Description  : This function is executed when the INTRCANGERR interrupt is received.
 * Arguments    : none
 * Return Value : none
 *********************************************************************************************************************/
#if (CAN_CFG_INTRCANGERR_USE != 0)
R_BSP_PRAGMA_STATIC_INTERRUPT (r_can_glb_error_isr, CAN_INTRCANGERR_VECT)
R_BSP_ATTRIB_STATIC_INTERRUPT void r_can_glb_error_isr(void)
{
    uint16_t  i_sources;
    uint16_t  gerfl_l_value;

    i_sources = CAN_SOURCE_NOTHING;

    /* Read Global error flags */
    gerfl_l_value = GERFLL & CAN_U16_USER_IE_GERFLL;

    /* Clear interrupt flags */
    while (0u != gerfl_l_value)
    {
        /* Clear Global error flags (DEF, CMPOF) */
        GERFLL = (~gerfl_l_value) & (CAN_U16_BIT3_ON | CAN_U16_BIT0_ON);

        /* Set interrupt source */
        i_sources |= gerfl_l_value;

        /* Clear flags for Global error flag MES */
        if ((gerfl_l_value & CAN_SOURCE_GERR_MLT) != 0u)
        {
            uint16_t  fmsts_value;

            fmsts_value = FMSTS & CAN_U16_USER_IE_FMSTS;

            /* Change interrupt source format */
            fmsts_value = 
                ((fmsts_value & CAN_U16_BIT8_ON) |
                ((fmsts_value & (CAN_U16_BIT1_ON | CAN_U16_BIT0_ON)) << CAN_POS_SOURCE_MLT_RF));

            /* Clear FIFO message lost */
            if ((fmsts_value & CAN_SOURCE_GERR_MLT_RF0) != 0u)
            {
                RFSTS0L = CAN_U08_RFSTSL_CLR_RFMLT;
            }

            if ((fmsts_value & CAN_SOURCE_GERR_MLT_RF1) != 0u)
            {
                RFSTS1L = CAN_U08_RFSTSL_CLR_RFMLT;
            }

            if ((fmsts_value & CAN_SOURCE_GERR_MLT_CF) != 0u)
            {
                CFSTSL  = CAN_U08_CFSTSL_CLR_CFMLT;
            }

            /* Set interrupt source */
            i_sources |= fmsts_value;
        }

        /* Clear flags for Global error flag THLES */
        if ((gerfl_l_value & CAN_SOURCE_GERR_TXH_LOST) != 0u)
        {
            THLSTSL = CAN_U08_THLSTSL_CLR_THLELT;
        }

        /* Read Global error flags again */
        gerfl_l_value = GERFLL & CAN_U16_USER_IE_GERFLL;
    }

    /* Call the user callback function */
    CAN_CFG_CALLBACK_GLB_ERROR(i_sources);
}
#endif /* end of (CAN_CFG_INTRCANGERR_USE != 0) */
/**********************************************************************************************************************
 End of function r_can_glb_error_isr
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: r_can_ch0_transmit_isr
 * Description  : This function is executed when the INTRCAN0TRM interrupt is received.
 * Arguments    : none
 * Return Value : none
 *********************************************************************************************************************/
#if (CAN_CFG_INTRCAN0TRM_USE != 0)
R_BSP_PRAGMA_STATIC_INTERRUPT (r_can_ch0_transmit_isr, CAN_INTRCAN0TRM_VECT)
R_BSP_ATTRIB_STATIC_INTERRUPT void r_can_ch0_transmit_isr(void)
{
    uint16_t  i_sources;
    uint16_t  gtintsts_value;

    i_sources = CAN_SOURCE_NOTHING;

    /* Read TX interrupt register */
    gtintsts_value = GTINTSTS & CAN_U16_USER_IE_GTINTSTS;

    /* Set interrupt sources and clear interrupt flags */
    while (0u != gtintsts_value)
    {
        uint16_t  sts_value;

        sts_value = 0u;

        if ((gtintsts_value & CAN_U16_GINTSTS_TSIF_ON) != 0u)
        {
            /* Get TX completion status */
            sts_value |= (TMTCSTS & CAN_U16_USER_IE_TMTCSTS);
        }

