released/RL78_F24_CAN/src/smc_gen/r_rscanfd_rl78/r_rscanfd_rl78.c
        if ((gtintsts_value & CAN_U16_GINTSTS_TAIF_ON) != 0u)
        {
            /* Get TX abort status (and shift abort status by 4bit) */
            sts_value |= ((TMTASTS & CAN_U16_TMTASTS_MASK) << CAN_POS_SOURCE_TRMA);
        }

        /* Clear TX buffer status if TX completion or abort  */
        if ((sts_value & CAN_SOURCE_TRM_TM0) != 0u)
        {
            TMSTS0 = CAN_U08_CLR;
        }

        if ((sts_value & CAN_SOURCE_TRM_TM1) != 0u)
        {
            TMSTS1 = CAN_U08_CLR;
        }

        if ((sts_value & CAN_SOURCE_TRM_TM2) != 0u)
        {
            TMSTS2 = CAN_U08_CLR;
        }

        if ((sts_value & CAN_SOURCE_TRM_TM3) != 0u)
        {
            TMSTS3 = CAN_U08_CLR;
        }

        if ((gtintsts_value & CAN_U16_GINTSTS_CFTIF_ON) != 0u)
        {
            /* Clear interrupt flag of CFIFO */
            CFSTSL = CAN_U08_CFSTSL_CLR_TXIF;

            /* Set interrupt source CFIFO */
            sts_value |= CAN_SOURCE_TRM_CF;
        }

        if ((gtintsts_value & CAN_U16_GINTSTS_THIF_ON) != 0u)
        {
            /* Clear interrupt flag of TX history list */
            THLSTSL = CAN_U08_THLSTSL_CLR_THLIF;

            /* Set interrupt source TX history list */
            sts_value |= CAN_SOURCE_TRM_TXHIST;
        }

        /* Set interrupt source (TX buf, CFIFO, TX history) */
        i_sources |= sts_value;

        /* Read TX interrupt register again */
        gtintsts_value = GTINTSTS & CAN_U16_USER_IE_GTINTSTS;
    }

    /* Call the user callback function */
    CAN_CFG_CALLBACK_CH0_TRANSMIT(i_sources);
}
#endif /* end of (CAN_CFG_INTRCAN0TRM_USE != 0) */
/**********************************************************************************************************************
 End of function r_can_ch0_transmit_isr
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: r_can_ch0_cfifo_rx_isr
 * Description  : This function is executed when the INTRCAN0CFR interrupt is received.
 * Arguments    : none
 * Return Value : none
 *********************************************************************************************************************/
#if (CAN_CFG_INTRCAN0CFR_USE != 0)
R_BSP_PRAGMA_STATIC_INTERRUPT (r_can_ch0_cfifo_rx_isr, CAN_INTRCAN0CFR_VECT)
R_BSP_ATTRIB_STATIC_INTERRUPT void r_can_ch0_cfifo_rx_isr(void)
{
    uint16_t  i_sources;

    i_sources = CAN_SOURCE_NOTHING;

    /* Clear interrupt flags */
    if ((CFSTS & CAN_U16_CFSTS_CFRXIF_ON) != 0u)
    {
        /* Clear RX FIFO interrupt flag of Common FIFO */
        CFSTSL = CAN_U08_CFSTSL_CLR_RXIF;

        /* Set interrupt source (Receive Common FIFO) */
        i_sources = CAN_SOURCE_RECV_CF;
    }

    /* Call the user callback function */
    CAN_CFG_CALLBACK_CH0_CFIFO_RX(i_sources);
}
#endif /* end of (CAN_CFG_INTRCAN0CFR_USE != 0) */
/**********************************************************************************************************************
 End of function r_can_ch0_cfifo_rx_isr
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: r_can_ch0_error_isr
 * Description  : This function is executed when the INTRCAN0ERR interrupt is received.
 * Arguments    : none
 * Return Value : none
 *********************************************************************************************************************/
#if (CAN_CFG_INTRCAN0ERR_USE != 0)
R_BSP_PRAGMA_STATIC_INTERRUPT (r_can_ch0_error_isr, CAN_INTRCAN0ERR_VECT)
R_BSP_ATTRIB_STATIC_INTERRUPT void r_can_ch0_error_isr(void)
{
    uint8_t  erfl_value;
    uint8_t  fdsts_value;
    uint16_t i_sources;

    i_sources = CAN_SOURCE_NOTHING;

    /* Read channel 0 error flag register (LL byte) */
    erfl_value = C0ERFLLL & CAN_U08_USER_IE_C0ERFLL;

    /* Read TDC violation flag                             */
    /* (Even if TDC is not used, the flag is read always.) */
    fdsts_value = C0FDSTSLH & CAN_U08_USER_IE_C0FDSTSLH;

    /* Set interrupt sources and clear interrupt flags */
    while (0u != (erfl_value | fdsts_value))
    {
        /* Clear channel 0 error flag */
        C0ERFLLL = ~erfl_value;

        /* Set interrupt source (CAN0 channel error) */
        i_sources |= erfl_value;

        /* Read channel 0 error flag register (LL byte) again */
        erfl_value = C0ERFLL & CAN_U08_USER_IE_C0ERFLL;

        if (0u != fdsts_value)  /* TDCVF=1? */
        {
            /* Clear TDC violation flag */
            C0FDSTSLH = CAN_U08_C0FDSTSLH_CLR_TDCVF;

            /* Set interrupt source */
            i_sources |= CAN_SOURCE_CH_ERR_TDCV;
        }

        /* Read TDC violation flag again */
        fdsts_value = C0FDSTSLH & CAN_U08_USER_IE_C0FDSTSLH;
    }

    /* Call the user callback function */
    CAN_CFG_CALLBACK_CH0_ERROR(i_sources);
}
#endif /* end of (CAN_CFG_INTRCAN0ERR_USE != 0) */
/**********************************************************************************************************************
 End of function r_can_ch0_error_isr
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: r_can_ch0_wakeup_isr
 * Description  : This function is executed when the INTRCAN0WUP interrupt is received.
 * Arguments    : none
 * Return Value : none
 *********************************************************************************************************************/
#if (CAN_CFG_INTRCAN0WUP_USE != 0)
R_BSP_PRAGMA_STATIC_INTERRUPT (r_can_ch0_wakeup_isr, CAN_INTRCAN0WUP_VECT)
R_BSP_ATTRIB_STATIC_INTERRUPT void r_can_ch0_wakeup_isr(void)
{
    RCAN0WUPMK = 1u;

    /* Call the user callback function */
    CAN_CFG_CALLBACK_CH0_WAKEUP(CAN_SOURCE_WAKEUP);
}
#endif
/**********************************************************************************************************************
 End of function r_can_ch0_wakeup_isr
 *********************************************************************************************************************/
